{"0": {"Patterns": ["My result of first semester is not showing correctly,I have been removed from 2 courses,I have contacted COE for the same and still not resolved ", "I cannot find the SGPA or marks of 1st and 2nd semester . ", "When we would get to know the final result of gpa of this semester", "The results for the 3rd Semester are appearing too good to be true. Around 50-60 people are getting 10 sgpa. Many students are still confused is the result correct or not, please confirm whether the result is correct or not.", "Minor was not supposed to be calculated in total SGPA, but here in my case, it is, I raised a complaint and\n was told to contact coeoffice@bennett.edu.in or coe@bennett.edu.in\nI emailed them, but havent heard back, IT'S BEEN 2 DAYS.\nPlease help"], "Responses": ["Kindly add the screenshot of your result which is reflected on your screen and also the registration slip", "Result sent ", "Dear kancharla, Results of end term will be declared On 13th January 2023", "Dear Student,\nyou can confirm the grades with your respective faculties of each course.\nas far as i know this is the correct result if any change wil be there you will be communicated.\nThanks.", "Dear Student,\nAnything related to the Result will be taken care by Coe only.\nKindly mail them and mark a cc to nikhil.mishra@bennett.edu.in"]}, "1": {"Patterns": ["I am a CSE 2nd year student and I wanted to drop my ICIE281M Minor. Here is my drop form. \nRegards,\nSiddharth Suman Singh\nE21CSEU0617", "Greetings!\nI want to drop my minor course in entrepreneurship, I the form signed by our faculty. Kindly help me with the procedure. \nRegards\n", "i want to drop ICIE281M The world of startup ideas", "I want to drop the ICIE281M THE WORLD OF STARTUP IDEAS from academics.", "Is it ok sir", "Thank You Sir", "i wish to drop out of the CIE minor i have elected for", "thankyou sir", "Sir i am unable to upload the document", "I want to drop my course in CIE minor... course details are attached in the form", "Drop form", "Course Drop for Foundations of Entrepreneurship", "I have to drop cie minor course from my curriculum ", "this is the add/drop form", "Sir ,\nHow much time will it take ?", "Dropping CIE minor for 3rd sem", "I would like to change my batch from Eb09 to Eb05 .I have discussed this with Mr Deepak Garg and asked for his approval.", "change of elective course", "I want to change my open elective from Digital Marketing to Web Technologies. [B. Tech CSE 2nd Year]", "I want to change my open elective from CSET487 Digital Marketing to CSET382 Web Applications for my Btech 4th Semester. The add/drop form is attached with it.", "Here is the drop course performa", "Change my 3rd Semester Elective to CSET-382 WEB TECHNOLOGIES from CSET-492 Advance Skill enhancement", "Here is the Elective Add/Drop form. ", "i have uploaded the document and want to change open elective from digital marketing to web technology", "Hey! I'm willing to swap my Open Elective course with another.\n\n\nFrom: CSET 492 - Advanced Skill Enhancement\nTo: CSET 489 - Search Engine Optimization", "I raised a query before about my course registration as I had to register for my minor. I wanted to drop my minor. What do I do? I will attach my drop form from last semester.", "on it, thanks.", "I have uploaded the files", "Sir,\nI want to drop the course code ICIE282M.I am attaching the form.Kindly do the needful.", "Sir\nI would like to drop course code ICIE282M I am attaching the form kindly please do the needful", "drop CIE Minor", "form is filled"], "Responses": ["Dear Student,\n\nas per your request your course has been dropped", "Dear Student,\n\nas per your request your course has been dropped", "Dear Student,\n\nAs per your request your course has been dropped.\nThanks.", "Dear Student,\n\nAs per your request your course  has been dropped.", "Dear Student,\n\nAs per your request your course has been dropped", "Dear Student,\n\nAs per your request your course has been dropped", "Dear Student,\n\nAs per your request, your course has been  dropped.", "Dear Student,\nAs per your request your course has been dropped.", "Dear Student,\n\nAs per your request your course has been dropped.", "Dear Student,\n\nAs per your request your course has been dropped.", "Dear Student,\nAs per your request your course has been dropped.", "Dear Student,\n\nAs per your request your course has been dropped.", "Dear Student,\n\nAs per your request your course has been dropped.", "Dear Student,\n\nAs per your request your course has been dropped.", "Dear Student,\n\nAs per your request your course has been dropped.", "Dear Student,\n\nAs per your request your course has been dropped.", "Dear Student,\n\nAs per your request, your batch has been changed.\n\nThanks.", "Dear Student,\n\nAs per your request your course has been dropped, it will be updated on LMS Shortly.", "Dear Student,\n\nAs per your request your course has been dropped, it will be updated on LMS Shortly", "Dear Student,\n\nAs per your request your course has been dropped, it will be updated on LMS Shortly", "Dear Student,\n\nAs per your request your course has been dropped,", "Dear Student,\n\nAs per your request your course has been dropped, it will be updated on LMS Shortly.", "Dear Student,\n\nAs per your request your course has been dropped, it will be updated on LMS Shortly.", "Dear Student,\n\nAs per your request your course has been dropped, it will be updated on LMS Shortly", "Dear Student,\n\nAs per your request your course has been dropped, it will be updated on LMS Shortly", "Dear Student,\n\nAs per your request your course has been dropped", "Dear Student,\n\nAs per your request your course has been dropped, it will be updated on LMS Shortly.", "Dear Student,\n\nAs per your request your course has been dropped, it will be updated on LMS Shortly.", "Dear Student,\n\nAs per your request your course has been dropped", "Dear Student,\n\nAs per your request your course has been dropped", "Dear Student,\n\nAs per your request your course has been dropped.", "Dear Student,\n\nAs per your request your course has been dropped, it will be updated on LMS Shortly."]}, "2": {"Patterns": ["l", "when will we get 2nd year BTECH CSE time table as classes are from tomorrow ", "when will we receive our timetable?", "I'm from Btech 2020, Can i select Natural Language Processing and Image and Video Detection together? (2 Specialization electives)", "batch change", "sir choosing minors subject option is not available while doing course registration so where we have to do", "Time table for classes not given to B Tech class of 2025 yet.", "Respected Sir/Ma'am\nI hadn't receive any time-table yet for B.TECH CSE 2nd Year AY2022-2023 EB26 Batch and  our classes are going to be start from tomorrow (i.e.08-08-2022).\nPlease update me asap.", "I chose for fullstack as specialisation in csebu webapp but due to some issues in backend ,my entry was not registered and I can't do my course registration . So please change my course from core cse to fullstack specialisation ", "No option to select a minor during cpurse registration ", "Regarding delay in offer letter for 7th sem. \nSir, for 7th semester internship I am joining KPMG, Gurgaon. But due to multiple holidays in this week, HR department is telling me that my offer letter can get a bit delayed from the deadline date(16 jul", "Where it is?", "I have already informed my specialization preference that is data science but in the collpoll specialization registeration is not reflecting.", "i am selecting my specialisation in data science but it is forcing me to choose the AI specialisation also and until then it is not letting me submit. please help me in this", "this app is so bad, the option to upload documents dosnt come in the webversion and in the phone it takes a century to load itself", "please drop the course \"PROTOTYPING AND BUSINESS MODELING\" from my registration form", "I recently changed my batch from EB20 to EB10. My collpoll is showing the batch as EB10 but my LMS isn’t because of which I’ll not be able to access the lecture material and assignments. I'll also not be able to submit my assignments.", "My name is Ravi Singh. I am currently in 7th smester. During Resigtarion on webapp https://webapp.csebu.com/ for internship. I choose Self by mistake. It should be BU. Now i can't edit th details. Can you change this option from Self to BU. ", "My enrollnment No is E19CSE270", "specialisation selection ", "Sir i  my course registration  it showing gaming specialization but i have done registration  of only cybersecurity so pleasehelo", "EPHY108L-Mechanics; EMAT102L-Linear Algebra and Ordinary Differential Equations; EECE105L-Fundamentals of Electrical and Electronics Engineering", "When I did the course registration collpoll was asking to select all core course for the registration. I did but I didn't want to opt for minor, but I had to in order to complete my Registration so now I want to drop my minor.", "Course to be dropped - Big Data Analytics and Business Intelligence | CSET371 | 3credits , Course to be added - Data Visualization and Dashboards | CSET370 | 3 credits", "i attended the first class of agile but it seems i will be able to do much better in C++ class. Also i will be able to brush up my programing skills.", "I am a third year student and i want to change my elective from Agile Software Development to C++. My enrollment number is E20CSE167", "sir/mam \nMy self Chandresh 2nd year student .Sir when I add all course it became total 25 credit and it is mention that it should be min 26 and when I click on complete registration ,it wont be .\nWhat to do ?\nI have mailed on outlook before17 aug 5pm", "I have opted Data Science", "not working ", "br", "I have not done the course registration so i am unable to see the specialization course in the lms,kindly look into it.", "I can't see my full stack specialisation course on lms. course code:- CAET218", "Ai specialization course is not being shown in my lms. I can't access the assignment submissions and quizzes ", "I can't see my full stack specialisation course CSET218", "please provide with swayam courses\n", "My specialization course CSET211 Statistical Machine Learning is not visible on colpoll, but visible on LMS, also attendance is not getting marked in most of the classes , although was present in all of them and punched my thumb in machine", "In academics section, attendance is not getting recorded", "I have registered only for internship course in 7th semester, but when I went to collpoll to view my result I saw I that I was enrolled in Introduction To Iot, I did not register for this course.\n I am attaching my Registration Slip.", "I want to change my batch as I am not comfortable with my current batch.", "Respected sir,\nI want to change my batch from 29 to 26 because my roommate is also in batch 26 and it will be good if we will be in same batch and will also get each other support during study.\nThanking you ", "I have some of my friends in batch 18. If it is possible then please. It would be of great help.", "being a dayscholar it is very hard for me to wait for my class as there are huge gap of timings between classes as i have to travel back and it costs me about 2 hours can you transfer me to another batch that is time friendly?", "Even after punching my attendance in every class just after the teacher punches still showing absent on collpoll and all my batchmates have just 25 classes reflected on collpoll whereas my collpoll is showing 45 classes please see to it.", "i am unable to see my Data science using python course lecture and lab on collpoll ", "attendance is not correct", "attendance not getting updated on collpoll", "sir its very hectic for me to stay out from 6 in morning till 9 at night can you help me a bit as i will shift nearby by nov end", "Sir I want to change my batch from B37 to B11,as all my hometown friends are in B11....It will be beneficial for me as i will find my peer group....", "attendance not being updated on collpoll\n", "How can we that there is CSET102 or CSET103+107 in our syllabus? ", "I thought that I have cset103 and 107 because I received this mail from outlook. And I have not attended any class of cset102. So how can I change my batch? So that I can get 103 and 107?", "No problem I will try to cover up the work of cset102, no need to change my batch", "At which option in collpoll app we can see our attendance?", "My LMS app is not opening due to this glitch/error which I hv attached in the image", "Each and everything That is to be uploaded on LMS takes time . It must be not like that .\nkindly arrange it", "EPHY105L Course not visible on LMS", "I am not getting any mails sent out the group cse2019@bennett.edu.in\nAny mails from Deepak sir regarding this are very important. Please help me resolve this at the earliest.", "Will we get some attendance relief by giving medical certificate because I got sick of cold and fewer 2 times since the beginning of the semester and the attendance is also not being uploaded in collpoll so that we know what our attendance is??", "I am a day scholar.", "mid term feedback page is coming blank.Kindly look into this.Attaching the screenshot for reference.", "course not available on lms ", "I would like to request you to issue my zero backlog certificate as I require it for applying to a master's degree. I have cleared my bachelor’s degree with zero backlogs in till 6 semester and therefore ask you to issue a certificate verifying same.", " Request to provide a No Backlog Certificate as I need it in order to apply for Masters. I have got 0 Backlogs till date (7th sem ongoing)  and just want a certificate verifying the same. \nName - Shubham Gautam,Enrollment Number -  E19CSE086", "I want to drop from CIE Minor course", "I wanted to drop out from the CIE Minor Course. I have filled up the form for dropping out, and I got it signed by Manish Mathur Sir. Where should I submit it? ", "Sir, I wish to report a bug. While we submit a CLO Feedback, On clicking on submit the page gets redirected to Login page.\nThank you\nDivyansh", "Is the registration (mentioned on 13th January) online or offline and till what time can you confirm the start of teaching day of 2nd Semester as I have to book my travel accordingly!.", "Where should I submit the form ?", "They said talk registrar and they told to generate ticket for the same on scset web app", "Acadamic Document ", "Thank you for your support.\n\nMy case was on medical grounds and I was hospitalized. Should my next step be to contact Soni Mam?", "How to apply for the makeup examination as no email has beent to us regarding the same", "Will we get absolute marks that we have scored or will there be relative marking.", "Visit International Country - Visa Requirement", "I want to change my batch From EB13 TO EB22", "Are the Tutorials and Labs being held in the First Week", "Sir as per the mail of BATCH CHANGE, it will start on 16 January from 3 - 6 p.m. But sir 2nd year students have their classes from 16 January. Sir it will be very cumbersome to manage our labs and tutorials. Kindly prepone the date for the same.", "What does PP means?\nMy Results shows PP infront of the grading section.", "Cannot find CSET492: Advanced Skill Enhancement on any of the course catalogues made available to us. It is one of the only three open electives offered in 4th semester. Please share the detailed syllabus so that I can make an informed decision.", "i want to know last date of fees submission of cse 2nd semester ", "What about the open elective I choose to Study. \nAlso is it really necessary to study those courses which chosen by your polling system.\nDo we have any other choice as open-elective are meant to be chosen by us.\nPlease acknowledge", "I want to select a course which is not in the options and none of my prefeered courses are here", "If possible please add more courses to the pool and can you please tell what we learn in advanced skill enhancement", "have dues of last sem also. So should i clear my last sem dues so that i can do online registration?", "I registered for semester 4 on 10th January itself. Till then only Digital Marketing, SEO and Advanced Skill enhancement were mentioned for open elective. Recently new courses have been added that I am in interested in, how should I change my course?", "Okay sir thank you so much, yes the open elective though has 3-0-0 but specifically advanced skill course shows lectures and practical on coll polll.", "When Will We Recieve timetable for Next Semester Classes?", "I've sent the mail to them but no response. It has happened 3 days but still no reply", "Good Afternoon.\nI need to know that can we add or drop open elective courses after the registration.", "Haven't heard back from the specified email, it's been 2 days.\nPlease look into the matter", "I am Siddharth E21CSEU0617. I had dropped my minor last semester yet it was still showing in collpoll course registration. For the time being I registered with the minor since it wouldn't allow me to register. Do I need to drop the minor again?", "doubt in Course Registration I am second year btech student i want to ask in advance skill Advancement In collpoll that is showing Practical but in course handout that is showing 3-0-0. We are not getting any clarity \nPlease help in that ", "Classes are going to start tomorrow but haven't received timetable yet", "course 382(web technology) is not present in timetable shared today", "I request you to change my batch as majority of my specialization batchmates and club co-workers are in EB25.", "My current batch eb24 new batch eb25", "App is not working so I raised the request here", "Sir I am being enrolled in minor course in previous semester but it ain't showing the option to add minor course on collpoll.", "Yes sir I got the end terms marks for the minor subject", "The course of digital marketing CSER487 is not mentioned in the time table of the 4th semester 2023.so kindly sort this issue out.\n\nGAURAV KUMAR JAISWAL\nE21CSEU0309\nEB17\nG3", "my backlog course is not available during  registration ", "I am not able to see my nr/backlog in course registration. Therefore please avail the backlog courses so that i can clear it this semester. As the 4th semesters's courses are worth 24 and max credit can be 28.", "We cannot see the timetable for the course sociology of gender, it has a different course code that isnt available on the timetable. please provide with a timetable as soon as possible", "We cannot see the timetable for the course sociology of gender, it has a different course code that isnt available on the timetable. please provide with a timetable as soon as possible.\n", "My reason for batch change is that my friend with whom I study is in batch 2 ", "Need to change batch from batch 4 to batch 1 ", "No I don't. I do have a minor entrepreneurship course though but I had gotten a mail that I had been removed from that. I can't even add that because the credits then go upto 29 and max credits is 28. I don't want to pursue the minor either.", "i want to be in batch 2 i am currently in batch 5. All of my good friends are in batch 2 which encourges me to study and sir i am having problem to be friends with batch 5 students so please change my batch ", "Sir my backlog courses are still not visibile on the collpoll website kindly update it so i can select it as a course for the 4th semester regards", "Not able to see Sem Internship on https://webapp.csebu.com/", "My AI MLCSET301 course is not visible on LMS ", "i am not able to find the mail, can the link of the form be provided here?", "i have writtern the mail and they asked me to contact program co ordinator", "This is to tell you that SCSET web app is not showing the updated time table for the faculties undre the faculty info tab as it is showing the TT for the prvious sem. kindly resolve this issue.", "Sir digital marketing is a 3 hr credit course but in our timetable it's showing 5 classes, please clarify the same.", "Sir digital marketing(CSET487) is of 3 lecture course but in our timetable 5 lectures are mentioned.please confirm us the time table of this course.", "i want to drop my course", "i want to change the open elective from digital marking to web technology", "In course registration, it is already showing sociology instead digital marketing, do I still need to add or drop a course", "Dear sir, I am opting for internship for my 8th semester but there is no semester internship option in my CSEBU dashboard.Can you please look into the matter as soon as possible.", "I am not able to upload the inital goal report", "Webapp is not accepting my intership initial goal submission", "I want to update my offer letter of 8th Semester Internship. Kindly help ", "I am unable to add courses and my fee was also cleared", "remaining amount of fees payed by imps\nproof submitted on collpoll ", "I can't see the sem internship link on the cset app", "Sir, as per our conversation on call yesterday, I would request you to change my open elective from SEO to Web technologies.\n Name Anshul\nEnroll E21CSEU0196\nBatch EB09\nBtech Second Year", "I am a Btech CSE student, currently in my 2nd year . I have recently secured an internship opportunity with DRDO, and I am very excited about this new learning experience. As per the general procedure I’m required to share an NOC. Further details lik", "I had dropped out of Image and Video Processing course and opted for Special topics in computer science. I've been receiving emails regarding Image and Video Processing class and it also shows up on my collpoll and LMS.", "May I please know where the deadline for changing the electives was specified?", "It's an online internship so I don't think that it will clash with my regular routine. So I request you to please provide me an NOC to proceed as it took me a lot of effort and time to get this internship"], "Responses": ["Dear Student,  Kindly share the query.", "You will get the timetable before the commencement of classes.", "Dear Student, You will recieve the Time Table very soon.", "Dear Student, You have to Select only one Specialization in Term V.", "Dear Students,   We have received few emails regarding batch change. To facilitate this functionality it has been automated in the cset webapp. You will only see those target batches in the application where the number of students is less than 30. The fun", "Dear Student, you will see the option to the top right corner, if still not visible attach screenshot", "Dear Student, you will recieve time table shortly", "Dear Student, you will recieve time table shortly", "the specialization is finalized at the time of your choice entry in CSEBU webapp when Dean Sir circulated that mail", "Which minor you want to opt", "Will get back to you after the disccustion with Dean Sir.", "Dear Student, due to some technical error it was not visible, CollPoll team has worked on this", "Dear Student all specialization related issues are pending with collpoll team", "it is fixed, i am closing this query", "Call me at 9811792695 or send an email along with proper specification of courses which you want to add or drop. add code too.", "Dear Student, I have removed minor course Prototyping and business modeling. kindly check again.", "Dear Student, as communicated earlier it will take a little time.", "Will do.", "Will do.", "Dear Student Kindly describe your query and revert on this chatbox", "Dear Student, you need to raise your request through Add/drop feature on CollPoll for dropping the course", "Dear Student, Kindly describe your query", "Dear Student, I didnt found any minor course in your registrated courses. Kindly check again.", "Dear Student,  kindly send request for Add/Drop courses on CollPoll.", "Dear Student, it has been updaed on CollPoll. but next time you are requested to send the add/drop request on CollPoll.", "Dear Student, it has been updaed on CollPoll. but next time you are requested to send the add/drop request on CollPoll.", "Dear Student, this is due to technical glithch and it has raised to collpoll. if it is not adressed yet then kindly put a reminder to it so that it can be escalated", "Let me check it with TT team", "Dear Stuent, kindly elaborate your query", "Dear Student Kindly go with the option you can see on your CSE BU portal regarding BR nomination", "Course Registration on CollPoll or LMS? Please specify", "Kindly send a mail to Shakti Singh regarding the same", "Dear Studeent, your query has been addressed and it will be sorted by EOD", "Dear Student it is not visible on CollPoll or LMS?", "Dear Varnika, Please contact to  me on my phone number 7503699484/8178021662 . Whenever you are free  for this regards", "Dear Student, i can see your course on CollPoll, if you still have issues kindly come at A block 1st Floor", "Alright, so there are some server issues thats why your attendance is not reflecting on the system. we are on it and it will be resolved Shortly.", "Your query has been resoloved..", "Dear Ayush, Really sorry it is not possible atleast in this semester, lets see if any vacancie in next semester, then you will be informed on collpol app.", "Dear Arpan, You can any time support or study together with  your friend as the curriculum will remain same and what i can see is your group will also be same (Group 4), but batch change is not possible, you can check in next semester if any vacancies are", "Dear Ayush, Really sorry it is not possible atleast in this semester, lets see if any vacancie in next semester, then you will be informed on collpol app.", "Dear Kartik, Batch change is not a solution, as no batch will be time friendly for you, but I would suggest you to not go back in between classes or practicals and utilize that time for some library surfing or exploring more in coding, which will help you", "Dear Student, you can come at A block 1st Floor to clear your doubts", "you can come to A block 1st Floor to clear your doubts", "Yes, due to some technical glitch it is not reflecting on your collpoll, we are working on it and it will be updated soon", "Yes, due to some technical glitch it is not reflecting on Collpoll, you need to keep on marking your attendance as it is getting recorded. the technical glitch will be resolved shortly.", "Dear Kartik as i said earlier too, there is no batch which is time friendly.", "Dear Suryansh, there is no vacancies in any batches, therefore its difficult to shift students to other batches. In next semester if there are any vacancies in any batch then you will come to know in collpoll and then  you can apply. Kindly wait till then", "Yes, due to some technical glitch the data is not getting fetched from the server so it is not reflecting, but you need to keep on putting your Attendance through biometric as it is being recorded", "Dear Kartik, as per you  batch no. CSEBE06_2022 you are in G1 group and you are having CSET102 course for this semester, next semester you will have CSET103 and CSET107 as your course.  For you to understand let me explain, groups G1 G2 G3 will have CSET1", "good to hear that", "good to hear that", "kindly dont follow attendance in collpoll for the time being.", "https://lms.bennett.edu.in this is the address for LMS, it should open, still you can contact it-helpdesk@bennett.edu.in, and shre them ur screenshot where the page is not loading", "Dear Rudraksh, for uploading data, check your internet connection if its speed is proper, orelse you can connect with IT at   it-helpdesk@bennett.edu.in", "Dear Nipun , kindly mail to shakti.singh@bennett.edu.in for your course mapping", "As discussed we are cheking this & update to you soon.", "Dear Kartike, As per UGC guidelines, 75% attendance is required for each course to qualify to sit in the final exam. This 75% is calculated by adding labs, Tutorials and lectures of the individual courses. This buffer of 25% contains coverage of all situa", "As I have already mentioned, you have to maintain 75% attendance, there is no way of applying for any kind of leave.", "Work in progress.", "Dear Mohak, Plz check your courses now.", "Dear Student, as per your request; we have sent Bonafide certifcate through email mode on your mail id.", "Dear Student, as per your request; we have sent Bonafide certifcate through email mode on your mail id.", "Dear Student,\n\nSorry for delayed Response", "Dear Student,\n\nYou have to Submit the form in Jpeg or PDF form on this query only.", "Ok divyansh , will inform the concerned team. thanks for your response.", "registration (mentioned on 13th January) is online via collpoll", "Get it signed by Manish Mathur Sir and send to this chat box only.", "It is the Registry Helpdesk System\nCSEBU Webapp is for your  Academic Related Queries.", "As per discussed Academic document already sent. ", "Yes", "Kindly Submit your request to me only I will take it for further Approvals.", "Dear Rajat, we have relative marking for your scores.", "Dear Divyansh provide me the details on mail.", "Dear Student,\nBatch change is not activated yet, you will get a notification in second week of January regarding the same.\nThanks.", "yes", "You just need to apply on CSEBU Webapp only, you can do it on your phone only.\nDates cannot be changed as it is fixed in the System.\nThanks.", "As discussed PP mean Passed.", "Dear Student,\n\nyou can look into Archives on CSEBU Webapp only.\nPFA syllabus for the Course CSET492.", "Dear Aditya, the last date for registration is 15th January 2023", "Dear Student,\n\n As we are getting multiple queries on the same issue we are planning to offer one more open elective, details will be shared with all of you by today", "You can only choose one course from the given bucket.", "Yes, course description will be shared with all of you by today.", "Yes, you need to clear all your dues to get the course registration window open for you, incase of any further query kindly in this kindly connect with divya.agarwal@bennett.edu.in.\n\nThanks", "Dear Student,\n\nPlease go through the guidelines shared by Registry office last month regarding course registration process.\nyou will get clarity on this.\nThanks.", "If any such update will be there then you all will be informed.\nThanks.", "Probably till Monday morning", "Dear Student, connect at Manish.gaur@bennett.edu.in", "Yes  you can, kindly go through the registration guidelines shared by registry department.\nThanks.", "Dear Student,\nAs they might be occupied so they are not answering, you can try in another few days to get it updated.", "Yes, it needed to be removed from your specialization.\nRaise a ticket again post 21 to drop your minor course", "Yes, you will be having a few lab classes in advance skill enhancement course.", "Dear Student,\nTT has been shared\nThanks,", "Dear Student,\nquery has been addressed and it will be shared by eod.\nThanks.", "Dear student,\n\nKindly clear your browsing cookies of last 1 hour and try login again.\nit will be visible to you.\nnote:- only the batches with less than 30 member will be visible", "Dear student,\n\nKindly clear your browsing cookies of last 1 hour and try login again.\nit will be visible to you.\nnote:- only the batches with less than 30 member will be visible", "Dear student,\n\nKindly clear your browsing cookies of last 1 hour and try login again.\nit will be visible to you.\nnote:- only the batches with less than 30 member will be visible", "Dear Student,\n\nWere you evaluated for the specific course in last semester?", "Will check and get back,\nmeanwhile you can share your marks here.\nThanks", "Dear Student,\n\nTT for all the OE has been shared with CSE2021 Batch.", "Dear Student,\nfor 2021 Batch there is no provision of backlog courses, you need to complete the course in Summer Semester only.\nThanks.", "Dear Student,\nfor 2021 Batch there is no provision of backlog courses, you need to complete the course in Summer Semester only.\nThanks.", "Dear Student,\n\nti will be shared shorlty.\nThanks.", "Dear Student,\n\nTime table will be shared shortly with all the registered Students.\nThanks,", "Dear Student,\n\nAs per instruction from dean sir, No requests will be entertained hereafter for whatever reason if you miss this window(16th January from 3 PM to 6 PM ).", "Dear Student,\n\nAs per instruction from dean sir, No requests will be entertained hereafter for whatever reason if you miss this window(16th January from 3 PM to 6 PM ).", "Dear Student,\n\nyou can refresh and try again.\nnow you will be able to register for this semester.\nThanks.", "Dear Student,\n\nAs per dear sir instruction, No requests will be entertained hereafter for whatever reason, if you miss this window.", "Dear Student,\n\nThere is no provision of backlog courses for 2021 Batch.\nnow you have to complete the course in Summer Semester only.\n\nThanks.", "Dear Student, clear browser cookies or change browser/device.", "Dear Student,\n\nyou are already added in the classes of CSET301, Kindly check again\nThanks.", "Kindly search by \"guideline\" keyword you will be able to find it.", "I have raised the issue with them, wait for now", "Dear Student,\n\nKindly share the screenshot of what you are currently seeing  to elaborate your query.", "Dear Student, Please note that there are 6 lectures in the timetable for CSET487 (Mon 1540, Tue 1640, Wed-1640 and Thur-1240 & 1330, Fri-1640) You can choose any 3 slots if you have any clash with your other courses.", "Dear Student, Please note that there are 6 lectures in the timetable for CSET487 (Mon 1540, Tue 1640, Wed-1640 and Thur-1240 & 1330, Fri-1640) You can choose any 3 slots if you have any clash with your other courses.", "Dear Student,\n\nYour course has been already dropped.", "Dear Student,\nyour course has already been changed to Web Technologies.\nThanks.", "No, \nif it is showing the desired course then no need to apply again for drop.\nThanks", "Issue has been resolved, Now Webapp is working smoothly.", "Now Webapp is working smoothly, kindly check", "Now Webapp is working smoothly, kindly check", "Kindly update your initial goal report & Upload offer letter in Webapp.", "Dear Student,\n\nAs the deadline for course registration has already passed, now you need to connect with registry department so that they can do your registration from backend.\nkindly write to registry@bennett.edu.in and chetna.pargai@bennett.edu.in", "Dear Student,\n\nKindly explain if you need any further Assistance?", "Dear Student, try following ways to resolve the issue ; clear your browsing history/cookies and try after that OR try using a different browser.", "Dear Student,\n\nafter discussing with competent authorities your request has been approved, kindly fill the add/drop form attached and send it back by 5 PM today, to this chat box only.", "Dear Student,\nyou can  take the Noc for Part-time or wfh internships only in which you can copeup with your classes.\nAs you are in second year so you will not be able to get the NOC for work from office opportunities.\nThanks.", "You are advised to ignore the mails you receive regarding Image and Video Processing, As i have checked you have opted for Special Topics in Computer Science as General Elective in this semester.", "Yes, in the mail itself shared by registry department.\nIt was clearly mentioned as last date to add/drop course will be 25th January.\nKindly go through guidelines shared by registry.", "Kindly share the requisition letter from the organization or any mail which you must have recieved from organization side.\nThanks,"]}, "3": {"Patterns": ["2nd batch", "need batch changed from b1 to b2. conflict of interest with certain individuals, best way to avoid more drama is to seperate us.", "I would like to change my batch from batch 03 to 01 since 03 is going to get dissolved.", "Batch change from BCA Batch-3 to BCA Batch-1 due to dissolution of Batch-3", "Sir/Maam\nI want to change my Regular Programme Elective  from Agile Software development to Programming using C++ as i chose agile software development by mistake.  ", "This is the registration slip of the courses that i chose before.", "Yes sir i was able to add c++ now", "Thankyou", "i have to drop a image and video processing as an specialization elective because i have already selected another NLP Course but i am not able to change from collpoll", "I have recently changed my specialization programme elective from Big Data Analytics and Business Intelligence to Data visualization and Dashboards but the change is not reflected on my LMS.", "Please change my specialisation elective to Data Visualisation and Dashboards.", "PS : It was previously Big Data Analytics.", "In collpoll under my profile , in the official records tab , my home address is wrong , and also my mother's phone number and email id is wrong, correct address is 6/60 krishna nagar gt road kanpur 208007, my mother's correct mobile no is 9450272554", "yes sir that has been updated , but also kindly update my mother's email id to lataanilarora@gmail.com,  and my date of birth to 11-03-2003", "kindly update these details also.", "Sir", "Kindly correct these wrong details", "i can't available to access my assignment and can't available to upload because it's not showing any assignment can you fix it fast i have to submit my assignment or otherwise i will lose my marks "], "Responses": ["Dear student your batch changing request has been updated on collpoll, kindly check", "Dear student, your request has been updated on collpoll, kindly check", "Dear student, your request has been updated on collpoll, kindly check", "Dear student, your request has been updated on collpoll, kindly check", "Dear Student, It has been updated. Kindly check again.", "Dear Student, It has been updated. Kindly check again.", "Dear Student, As I have checked your registered courses. it has been updated on CollPoll.", "Dear Student, As I have checked your registered courses. it has been updated on CollPoll.", "Dear Student, It has been updated. Kindly check your registered courses again.", "Dear Student, It will be updated on LMS this week.", "Dear Student, I have checked your registered courses on CollPoll in which you have taken Data Visualization as elective and it will be updated on LMS this week.", "Dear Student, I have checked your registered courses on CollPoll in which you have taken Data Visualization as elective and it will be updated on LMS this week.", "Updated, Kindly check again", "updated . check again", "updated . check again", "updated . check again", "updated . check again", "Updated"]}, "4": {"Patterns": ["I am aware that the timing was from 9 am to 9 pm and after that requests wont be granted, but I am really sorry as i was under the impression that the timing was till 12 am. Please let me change my batch.", "Sir, I wanted to change my batch to\nEB-25 but due to some error it is changed\nto EB-21 sir please do change it to EB-25\ncoz I don't want to lose this opportunity.\ncoz this is the last time we can change\nbatch. please sir help me", "Please sir do it", "semester 3 elective not showing", "How to transfer course credits from SWAYAM NPTEL courses?", "Will the credits of swayam can be added in academic transcripts", "I want to change my specialization from data science to full stack web development.Please do the needful ", "I want to drop FULL STACK and take PDT, please tell me any way in which I can do this, I am ready to do the 3rd Sem PDT course along with 4th sem one", "In our last semester we were given a form on the collpoll regarding the preferences of open-elective offered by SCSET.\nToday, during the registration we weren't given those choices which we made previously during the form submission. Pls Update", "Please provide a scope to change the given open electives, we should have the freedom to choose open electives as we want and those 3 chosen open electives are not at all satisfactory ", "Please provide a scope to change the given open electives, we should have the freedom to choose open electives as we want and those 3 chosen open electives are not at all satisfactory \n", "As a cs student ,can i take biological systems as my open elective ?", "In retrospect this elective isn't relative to my degree and future plans and would like to select a more befitting course that would increase the value of my CV", "i am not able to complete my resgistration on collpoll. please help.", "Sir,\nAs per our conversation over the call yesterday, i would request you to change my elective from SEO to WebTechnologies. \nThanks.\n\nName: Abheek Tripathy\nEnroll: E21CSEU0123\nBatch: EB08 \nBtech 2nd year.\nPhone No: +91 8920237098", "Resquesting to change the open elective course from SEO to Web Technologies"], "Responses": ["Dear Student, it is not possible now as the deadline is already crossed", "Dear Student, there was no error in the system, now changing of batch is not possible", "Dear Student, there was no error in the system, now changing of batch is not possible", "Dear Student, kindly mention which elective is not showing as there is no elective in 3rd Semester", "Dear Student, \nwhich course you are talking about can you please elaborate, as of now you do'nt have any such course.\nit is generally the open elective courses.", "Dear Prashant, Swayam is for electives, which is not applicable for first year.", "Dear Student,\nThere is no scope of Specialization change in the 4th Semester.\nyou need to continue with the same specialization only.\nThanks.", "Dear Student,\nThere is no scope of Specialization change in the 4th Semester.\nyou need to continue with the same specialization only.\nThanks.", "Dear Student,\nThe Courses which are offered are also coming from the preferences filled by Students, it is taken from Polling system so the course which got maximum numbers of vote is being offered for the semester.\nThamks.", "Dear Student,\n\nthe Open electives which are offered are coming from the preferences only.\nthe course which is maximum preferred choice is in offer.\nyou can select any of the courses from the offered Course Pool.", "Dear Student,\n\nthe Open electives which are offered are coming from the preferences only.\nthe course which is maximum preferred choice is in offer.\nyou can select any of the courses from the offered Course Pool.", "Dear Student,\n\nyou can choose any of the open elective which are in offer.\nThanks.", "Dear Student,\nThe deadline to change your course has already been passed, now there is no scope of elective change.\nThanks.", "Dear Student,\nThe last date of registration has already been passed,\nnow you need to write to registry@bennett.edu.in and chetna.pargai@bennett.edu.in. mentioning all the courses you need to register in.\nThanks.", "Dear Student,\nThe deadline to change your course has already been passed, now there is no scope of elective change.\nThanks.", "Dear Student,\nThe deadline for changing of Electives has already been passed and now there is no scope of change.\nThanks"]}, "5": {"Patterns": ["want to change batch from batch 51 to 52 ", "As I think group study is the better way to improve your acads and l and most of my wingmate are in same batch (B-33) and I'm the one who always feel leftout whenever they'd be having a GD and all study kind stuff. so please help me out to improve it", "change the batch from 13 to 12", "Change my batch from B37 to B 34", "Batch change to 52", "My friends are in batch 34 please change my batch to batch 34", "i want to change batch due to time table and lack of good study environment ", "Batch 14", "no communication ", "I want to change my batch to 24, currently I am in batch 22, and I don't have any communication and have a lot of trouble, please consider my request ", "I want to change my batch to 24 or batch 17, currently I am in batch 22. And I am having a lot of troubles in my current batch.", "Please change my batch to 24 or 17, I am having a lot of trouble with my current batch 22", "I have to change my from 28 to 46 as because I am unable to study in my own batch . I am uncomformtable in my batch that's why I have to change.", "i want to change batch", "I am not comfortable with some of the members and teachers in my batch(41) and want to be in my roommate's batch(42) so that we both can coordinate easily. ", "Please change my batch to batch 24 or batch 9, I am having a lot of troubles with my current batch 22", "Would like to be in batch 14", "Change to batch 21", "my friends are in batch 34 please change my batch to batch 34", "I really want to change my batch due to some really reasons . please help me with it", "Please help me with it. I'll be grateful.", "I would like to change my Batch to 28", "regarding batch change ", "Need to change my batch from 49 to 35", "i want to change my batch from 17 to batch 15 ", "nnnn", "When will batch change option come", "Batch change", "My batch mates are not supportive and they don't have helping nature so I want to change my batch to batch 45. Kindly help me out it will definitely help me in my studies... ", "i want to change my batch in b31 ", "I want to change batch ", " i'm failing to changing my batch because in new batch section nill batch's showing", "sorry for the late submission,  But i would like to change my batch from Batch-4 to Batch-3.Please", "Sir i wanted to change my batch 14 to batch23"], "Responses": ["Window is already closed, you can again try your luck in the next semester.", "Window is already closed, you can again try your luck in the next semester.", "Window is already closed, you can again try your luck in the next semester.", "Window is already closed, you can again try your luck in the next semester.", "Window is already closed, you can again try your luck in the next semester.", "Window is already closed, you can again try your luck in the next semester.", "Window is already closed, you can again try your luck in the next semester.", "Window is already closed, you can again try your luck in the next semester.", "Window is already closed, you can again try your luck in the next semester.", "Window is already closed, you can again try your luck in the next semester.", "Window is already closed, you can again try your luck in the next semester.", "Window is already closed, you can again try your luck in the next semester.", "Window is already closed, you can again try your luck in the next semester.", "Window is already closed, you can again try your luck in the next semester.", "Window is already closed, you can again try your luck in the next semester.", "Window is already closed, you can again try your luck in the next semester.", "Window is already closed, you can again try your luck in the next semester.", "Window is already closed, you can again try your luck in the next semester.", "Window is already closed, you can again try your luck in the next semester.", "Window is already closed, you can again try your luck in the next semester.", "Window is already closed, you can again try your luck in the next semester.", "Window is already closed, you can again try your luck in the next semester.", "Window is already closed, you can again try your luck in the next semester.", "Window is already closed, you can again try your luck in the next semester.", "Window is already closed, you can again try your luck in the next semester.", "Window is already closed, you can again try your luck in the next semester.", "Window is already closed, you can again try your luck in the next semester.", "Window is already closed, you can again try your luck in the next semester.", "Window is already closed, you can again try your luck in the next semester.", "Window is already closed, you can again try your luck in the next semester.", "Window is already closed, you can again try your luck in the next semester.", "It was a Dynamic window. Window is already closed, you can again try your luck in the next semester.", "Window is already closed, you can again try your luck in the next semester.", "Window is already closed, you can again try your luck in the next semester."]}, "6": {"Patterns": ["Chnage course from CSET344-Image and Video Processing to CSET-Natural Language Processing", "I want to Drop my minor CIE course", "I want to  drop my Minor course CIE", "I am a CSE 2nd year student and I would like to drop the CIE Minor that I took at the start of the semester. What is the procedure to do so?", "Greetings! \nI want to drop my minor course of Entrepreneurship as I am not able to mange time for the same. Please help me with this issue. \nRegards", "Ok sir", "Here is the response of the ticket sir", "I have to Drop CIE Minor Course", "i want to drop my course of Entrepreneurship as i am no longer intrested in it.", "i want to drop my course of entrepreneurship as i am not interested in it"], "Responses": ["Dear Student,  add/drop request you need to send on CollPoll.", "Dear Student,  You need to send the add/drop form mentioning the course you want to drop then it will be further taken to the approvals by me. You can find the add/drop form in the mail shared by Registry at the time of Registration process for Odd term 2", "Dear Student,\n\nYou must Send the add/drop form mentioning the course you want to drop then it will be further taken to the approvals by me.", "Dear Student,\n\nYou need to send the add/drop form mentioning the course you want to drop then it will be further taken to the approvals by me.", "Dear Student,\n\nYou need to send the add/drop form mentioning the course you want to drop then it will be further taken to the approvals by me.", "Kindly share the Add/drop form by mentioning the course you need to drop and get it signed by the concerned faculty.\nThanks", "Kindly share the Add/drop form by mentioning the course you need to drop and get it signed by the concerned faculty.\nThanks", "Dear Student,\n\nYou need to send the add/drop form mentioning the course you want to drop then it will be further taken to the approvals by me.", "Dear Student,\n\nYou need to send the add/drop form mentioning the course you want to drop then it will be further taken to the approvals by me.", "Dear Student,\n\nYou need to send the add/drop form mentioning the course you want to drop then it will be further taken to the approvals by me."]}, "7": {"Patterns": ["I am not able to find my results for Semester 1 & 2 in collpoll", "i want to know about hostel management, there is no. proper cleaning of room , we have to request them to clean the room ", "in first year cse course \nhow much percentage of midterm examination include in cgp ", "Hello sir \nI hitanshu Singh of batch 20 ,I am currently  suffering from 103° fever from last 2 days. I need to ask wheather to attend the codathon how will it affect my overall marks.", "Sir/ Ma'am \nI had emailed my medical to soni.nehra@bennett.edu.in\nSudeepta.chauhan@bennett.edu.in\nakhil.mishra@bennett.edu.in\nPlease make me aware what to do next", "Sir,\n\nI have missed the Midterm Examination of EPHY105L which was held on 17th of November 2022.\n\nIf there is any makeup exam, Kindly allow me to sit in that.\n\nAshutosh Kumar\nBatch -  21\nEnrollment Number - E22CSEU0615", "Sir,\n\nI have missed the Midterm Examination of EPHY105L which was held on 17th of November 2022.\n\nIf there is any makeup exam, Kindly allow me to sit in that.\n\nAshutosh Kumar\nBatch -  21\nEnrollment Number-E22CSEU0615", "Please let me know the make-up examination date sheet ", "Sir, \nI got my Medical approved by Soni Bans Nehra mam through Email. What next I need to do? Kindly tell me to whom I need to send Email? ", "regarding attendance on collpoll. there are many classes which I have attended but it is showing absent on that days \nand some time even biomatric don't work in lecture classes so attendance is getting short day by day ", "*Attendance*\nGood morning Sir/Mam,\nEven after attending, and putting my biometrics my attendance is not updated for the following classes:\nElectromagnetics Lecture: 24,25,30 Nov.\nComputation Thinking Lecture: 24,25Nov., Engineering calculus: 25nov."], "Responses": ["Dear Student, I have already replied to this issue. So i m closing this quary. Regards", "Dear Shubham, I have already replied to your query before, so I am closing this ticket.", "Dear Aditya, I have already replied before, kindly consult your batch mentor.", "I have already replied to your query before.", "As I have already replied your previous same query, therefore I am closing this query", "Dear Ashutosh,  I have replied your query in the previous one. therefore i am closing this query.", "Dear Ashutosh,  I have replied your query in the previous one. therefore i am closing this query.", "Dear Sumit, I have replied to your query kindly check", "Dear Ashutosh, as the same query is repeated, kindly refer the previous one where i have replied.", "As i have already replied your same query so i am closing this one as it was repeated.", "As i have already replied to your same query before therefore i am closing this query. kindly contact Saphal Anand <saphal.a@collpoll.com>\n\nsupport@collpoll.com     08045688015"]}, "8": {"Patterns": ["Sir/mam, i have had my biometrics attendance done in classes but on Collpoll its not showing the correct attendance. Please consider my application. I have also attached the screenshot so do also check it out. So that you better understand situation.", "I am regularly attending the classes and doing the biometric attendance. But In collpoll my attendance is not updated. There I Am Marked as Absent", "Ma'am, I'm attending all the classes but my attendance is still 1/7 and my parents are asking me why is it like that. Please guide me,what should i do", "attendance not counting", "attendance not showing on collpoll app", "I have been attending my lecture daily and punching my addandance on machine but on coll poll it is showing unnecessly absent and not showing any present ", "I have my friends as witness that I'm attending lectures and puchi g my fingerprint", "Please update my coll poll properly it is not syncing", "When we could see our attendance on collpoll because till now it is showing 0% attendance for all subjects despite of attending classes.\n", "My Attendance doesn't get updated on collpoll ", "Regarding Attendance: \nI attended HPC classes but it was showing absent in collpoll.", "Good morning Sir/Mam, Even after attending, and putting my biometrics my attendance is not getting updated in my collpoll.\nEnrollment number:E22CSEU1750\nName: Sanya Gupta\nBatch:42", "ATTENDENCE ISSUE\nI've been attending all my classes and marking my biometrics in the respective device but still it is not reflecting in my coll poll. Kindly look into this issue. E22CSEU1239\n Thankyou ", "I am facing a attendance issue in Collpoll, \nI have attended all the classes of 'Engineering Calculus' and 'Computational Thinking and Programming', even the fingerprint scanner is accepting fingerprint but it is showing absent in this subject. "], "Responses": ["Dear Diven, Kindly mail to c-saphal.anand@bennett.edu.in  or  Saphal Anand <saphal.a@collpoll.com> for all your queries regarding collpoll to get resolved", "Dear Tanish, kindly mail to c-saphal.anand@bennett.edu.in  or  Saphal Anand <saphal.a@collpoll.com> , for your collpoll queries to resolve", "Dear Mrituanjay, whenever you are using biomatrix make sure you punching after your concern Faculty. Aswell as see that your name is being displayed with green tick. Also you can mail to Saphal Anand at c-saphal.anand@bennett.edu.in  or saphal.a@collpoll.", "Dear Aman, Kindly mail to c-saphal.anand@bennett.edu.in or Saphal Anand <saphal.a@collpoll.com>  for collpoll related issues", "Dear Ansh, Kindly mail to Saphal Anand <saphal.a@collpoll.com>    or    c-saphal.anand@bennett.edu.in for collpoll related issues", "Dear Kunal, Kindly contact Collpoll, Mr. Saphal Anand for attendance. But to assure  if you are punching it properly and see your name displayed then your attendance is been recorded.", "Dear Kunal, Kindly contact Collpoll, Mr. Saphal Anand for attendance. But to assure  if you are punching it properly and see your name displayed then your attendance is been recorded.", "Dear Kunal, Kindly contact Collpoll, Mr. Saphal Anand for attendance. But to assure  if you are punching it properly and see your name displayed then your attendance is been recorded.", "Dear Kartike, its something which can be resolved by Collpoll, Kindly mail to Saphal Anand <saphal.a@collpoll.com> and cc to support@collpoll.com", "Dear Rajat, Kindly mail to support@collpoll.com and Saphal Anand <saphal.a@collpoll.com>  regarding your attendance.", "Dear Student, Kindly mail CollPoll Support and Mr.Saphal Anand regarding this issue.", "Dear Sanya, Kindly contact Saphal Anand <saphal.a@collpoll.com>\n\nsupport@collpoll.com", "Dear Aastha, I have acknowledged your query, also you drop a mail to Saphal Anand <saphal.a@collpoll.com> &\n\nsupport@collpoll.com", "Dear Shuaib, I have acknowledged your query, also you drop a mail to Saphal Anand <saphal.a@collpoll.com> & support@collpoll.com"]}, "9": {"Patterns": ["I want to know about the Minors and Honors Courses in detail that are being offered in Data Science.", "We were not even given a list of minors we can choose from so I wanna look at the list first but prefferably quantum tech", "I am a Btech cse 1st year student of batch 6 , and there are CSET 103, 107 AND 108 subjects in our course but there are no classes scheduled in our Timetable", "This is to notify you that I am interested in being BR of Section 25 CSE branch my enrollment number is E22CSEU0733 ", "don't able to understand the concept of physics by the facilitie", "Sample Ouestion papers before Mid Sem Examinations for more practise and understanding", "Teachers should provide some sample questions on lms so we can solely focus on the important topics regardless of mugging up everything", "Sir. \nthe Elibrary app is not working as expected earlier. as the book we search for as mentioned according to syllabus are never shown in Elibrary. so how are we supposed to study for semester exams\nkindly look into the matter please \n", "please i have to urgently call ozr practical lab teacher Dr Tej.can I get his number. i have an issue with codetantra Assignment . it automatically got submitted and yet it was not finished", "I want sample papers or previous year papers of all subjects please provide me ", "Please change our Physics Teacher , we can't understand anything..", "Solution of Tutorial 5 of subject CSET102: Introduction To Electrical And Electronic is not uploded for group 2 ", "What are the minimum passing marks out of 100 ?", "Actually I'm not greater noida right now and, I want to check my examination copies, So it is my humble request that whether it is possible to send me the snapshot of my copies because my score is very low and later on it will effect my grades as wel", "please explain how is relative marking done ?", "Thanks a lot for the response\nPlease explain how relative marking is done ?", "I'm not satisfied by my grades which I received. My sgpa is very low and I believe that it should not to be low. I've given all the exams and also my exams was not bad. So I’m not able to connect the things and the grading system. ", "I really apologize that i am informing it very late as it took me so long to understand my interest.But i am really not interested in data science as it doesn't really fascinate me.I am totally inclined towards web development.I am quite tensed now.", "As i really want to go forward with full stack development", "I am not pleased with the result I received.\nI have scored 50+ marks in every course but still my sgpa is less than 5. \nIf I have received 50+ marks in all courses, then I should at least get 6 grade points and C+ grade.", "i am not contented with the sgpa recieved. i want my marks and gradings to be overlooked. i did my end terms not that bad to recieve d in most subjects . kindly look into it . ", "Please reply with some sort of solution atleast.I am so much temsed regarding this", "No sir actually I really want to make my career in full stack web development not in data science and i am so sure about it now.Its my personal choice to go with full stack web development.It is not about difficulty in understanding the course.", "When i took data science i was confused between both full stack web development and data science but now everything is clear in my mind.Thats why asking for a solution.Please provide me some solution.", "I need to know if i stayed enrolled in data science but at the time of placements want to sit in web development placements will i get any difficulty due to data science specialisation.I am seriously learning web development", "Our Course CSET101 results are out but there are some discrepancies so there will be a change of marks,\nWhen will the new marks be updated \nAs our Final Scores will Be Out in 2 Days", "Can you please explain the nature of open elective \"Advanced Skill Enhancements\". How many labs will be conducted and can we choose our skill? ", "in course registration of EBTY183, it is shown 3components lab , tut and lect. But in the given time table it is just showing lectures.can u please tell the reason .", "I am the BR of batch 52, I am here Requesting you to please change the Maths Tutorial teacher Deval Verma of our batch. There are much students of our class who don't like her way of teaching and providing the required explanations for the topics.", "I am here Requesting you to please change the Maths Tutorial teacher Deval Verma of our batch. There are much students of our class who don't like her way of teaching and providing the required explanations for the topics."], "Responses": ["Dear Student , knidly contact with your faculty mentor", "to get the list kindly contact to your faculty mentor", "CSET103 and CSET107 will be conducted Online, therefore there were no classes yet. Online Classes will start from next week, ie; Monday probably, if any changes you will be informed by your Mentor, or respective faculty. And CSET 108 has been shifted, tha", "Dear AAkash, Regarding BR selection it will be informed you by your mentor in your watsapp group, kindly consult him", "Dear Nishant, I understand, if you are facing difficulties in understanding then I would suggest you to personally meet your faculty and discuss the areas you are facing issues, and also give some time for proper tunning between a professor and a student,", "Dear Student, Kindly contact to the concerned faculty for this, incase you are not getting any help kindly ask your faculty mentor regarding the same.", "Dear Student, Kindly contact to the concerned faculty for this, incase you are not getting any help kindly ask your faculty mentor regarding the same.", "Dear Ridam, There are lot of resources available to prepare for your exams, like LMS, Physical Library A block ground floor, aswell as your faculties. You can always consult your concernd faculty for more relevant materials required for your exam preparat", "Dear Ridam requesting contact details should be done to the repective mentor, in the respective watsapp group", "Dear Aditya, Kindly ask your concern faculty for papers.", "Dear Niyati, Talk to your respective faculty,  and let him know that you are not understanding. If not then you can also consult with Dr. Manish Raj for your concern.", "Dear Priya, Kindly connect with your concern faculty as he or she is the right person for tutorial.", "Dear Rajat, minimum marks are 30, still i would prefer you should always consult your Mentor for this query, or marks related query.", "Dear Student,\n\nKindly contact with the concerned faculty.\nthey can guide you about your examination copies.", "Dear rajat, Your Mentor is the right person to explain.", "Your Mentor is the right person to explain Relative marking  system", "Dear Student,\nyou can confirm the grades with your respective faculties of each course.\nThanks.", "Dear Student,\nyou have completed a semester with this specialization, there are multiple pre requisite for the courses.\nkindly talk to the concerned faculty if you are facing any difficulty in understanding the course.", "Dear Student,\nyou have completed a semester with this specialization, there are multiple pre requisite for the courses.\nkindly talk to the concerned faculty if you are facing any difficulty in understanding the course.", "Dear Student,\nyou can confirm the grades with your respective faculties of each course.\nThanks.", "Dear Student,\nyou can confirm the grades with your respective faculties of each course.\nThanks.", "Dear Student,\nyou have completed a semester with this specialization, there are multiple pre requisite for the courses.\nkindly talk to the concerned faculty if you are facing any difficulty in understanding the course.", "Kindly talk to your faculty mentor\nthey can give you some solution that how you will be able to get it done or maybe you can learn Full stack development", "Kindly talk to your faculty mentor\nthey can give you some solution that how you will be able to get it done or maybe you can learn Full stack development", "You can talk to the Faculty mentor they can give you better clarity on this.", "Dear Kancharla, Marks related any query will be attended by the faculty or concern course coordinator.", "Dear Student,\nthe course description will be shared by today with all the Students.\nas the course is of 3-0-0 so i guess there will be no labs.\nstill needed to be confirmed by the concerned faculty.\nThanks.", "Dear Student,\nyou can connect with the concerned faculty to get clarity on this.\nThanks.", "Dear Takshay, Kindly jott down all the points related to your faculty and discuss it with your mentor, as the BR meeting will be sceduled next week, you can keep the jotted points in front of Dean Sir.", "Dear Navneet, Kindly jott down all the points related to your faculty and discuss it with your BR and mentor, as the BR meeting will be sceduled next week, he can keep the jotted points in front of Dean Sir."]}, "10": {"Patterns": ["where can i get the add drop form?", "where can i get that form", "where can i get that form?", "open elective change from Nonlinear Dynamics and Machine Learning in Complex Systems to Digital Marketing ", "open elective change from Nonlinear Dynamics\nand Machine Learning\nin Complex Systems to digital marketing ", " I want to change my open elective subject\n I have selected digital marketing by mistake just now\n Can you help me change it to Web technologie", "change open elective ", "I completed my course registration on 10th January. Till then only four courses were being displayed including SEO which I chose. It was later that more subjects were added to choose from. I would like to drop SEO and take Web Technology CSET382.", "Would like to change my Elective from Advanced Skill Enhancement to Sociology ", "what is the procedure to drop minor?", "I want to change my open elective from \"Advanced skill enhancement\" to \"Web technology\". Batch-EB05 (2021 BATCH) Enrollement no.-E21CSEU0004", "Change of open elective from Non linear dynamics and machine learning in complex system to Digital Marketing", "i want to change my elective, as i selected android app development first but i am learning it side by side and i want to re-opt for another elective, please help", "open elective change from search engine optimization to digital marketing\n", "I want to change my open elective from CSET-489(Search Engine Optimisation) to CSET-487(Digital Marketing).", "I would like to change my open elective from “Non-linear dynamics and ML in complex systems” to “Digital Marketing”.  I have completed the necessary registration process as well.", "Sir I have selected Advanced skill enhancement as my elective in the 4th semester but I want to change my elective as digital marketing for the 4th semester.", "I'd like to change my open elective from Advanced Skill Enhancement to Digital Marketing.", "I want to drop my specialisation from gaming and add to full stack  as I am not able to understand the course ,more interested in web development please accept my request for changing my specialisation course", "I want to change my open elective from digital marketing to web technology", "I want to change my open elective from Digital Marketing to Android Development with Kotlin.", "I want to change my open elective from Digital Marketing with Android Development with Kotlin for 4th semester.", "I am currently enrolled in Regular Open elective called \" Nonlinear Dynamics and Machine Learning in Complex Systems\". However I want to change it to \"Search Engine Optimization\". I tried doing so through CollPoll itself, but couldn't do so.", "Changing elective course", " I would like to change my open elective from digital marketing CSET487 to web technologies CSET382.The options displayed for open electives at the time of registration i.e. 17th January 2023 didn't show web technologies.", "I would like to change my open elective from Digital Marketing CSET487 to Search Engine Optimization CSET489.", "I have taken Digital Marketing as Open Elective, Iwould like to change to Web Technologies.", "I want to change my open elective from Advance skills to biological machines. I have a strong interest in biology, and I know it's too late, but I was wondering if you could help me.", "ICIE282M: Understanding Markets and Customers,\n I would like to drop this course."], "Responses": ["Dear Student,\nyou can get the form in the mail sent by Registrar before the registration in Early August.\nthere will be a dccument consisting of multiple things and the form is in Annexure 2.", "Dear Student,\nyou can get the form in the mail sent by Registrar before the registration in Early August.\nthere will be a dccument consisting of multiple things and the form is in Annexure 2.", "Dear Student,\nyou can get the form in the mail sent by Registrar before the registration in Early August.\nthere will be a dccument consisting of multiple things and the form is in Annexure 2.", "Dear Student,\n\nyou can drop your course by filling out the add/drop form sent in the mail by Registrar in guidelines for registration.\nPlease fill the form and share it on this platform only.\nThanks.", "Dear Student,\n\nyou can drop your course by filling out the add/drop form sent in the mail by Registrar in guidelines for registration.\nPlease fill the form and share it on this platform only.\nThanks.", "Dear Student,\n\nyou need to fill the add/drop form.\nit is shared in the mail by registrar, it is there in the registration guidelines in annexure 3\nThanks", "Dear Student,\n\nyou need to fill the add/drop form.\nit is shared in the mail by registrar, it is there in the registration guidelines in annexure 3\nThanks", "Dear Student,\n\nkindly fill the Add/drop form, you can find the form in guidelines shared by Registrar before commencement of this semester.\nit is in Annexure 3\nThanks.", "Dear Student,\n\nyou can drop your course by filling out the add/drop form sent in the mail by Registrar in guidelines for registration.\nPlease fill the form and share it on this platform only.\nThanks", "Dear Student,\n\nyou need to fill the add/drop form. and send it on this portal only.\nyou can find the add/drop form in the mail shared by registrar before commencement of this semester.\nit is named as student registration guidelines.\nThanks.", "Dear Student,\n\nyou need to fill the add/drop form. and send it on this portal only.\nyou can find the add/drop form in the mail shared by registrar before commencement of this semester.\nit is named as student registration guidelines.\nThanks.", "Dear Student,\n\nyou can drop your course by filling out the add/drop form sent in the mail by Registrar in guidelines for registration.\nPlease fill the form and share it on this platform only.\nThanks", "Dear Student,\n\nyou can drop your course by filling out the add/drop form sent in the mail by Registrar in guidelines for registration.\nPlease fill the form and share it on this platform only.\nThanks", "Dear Student,\n\nyou can drop your course by filling out the add/drop form sent in the mail by Registrar in guidelines for registration.\nPlease fill the form and share it on this platform only.\nThanks", "Dear Student,\n\nyou can drop your course by filling out the add/drop form sent in the mail by Registrar in guidelines for registration.\nPlease fill the form and share it on this platform only.\nThanks", "Dear Student,\n\nyou can drop your course by filling out the add/drop form sent in the mail by Registrar in guidelines for registration.\nPlease fill the form and share it on this platform only.\nThanks", "Dear Student,\n\nyou can drop your course by filling out the add/drop form sent in the mail by Registrar in guidelines for registration.\nPlease fill the form and share it on this platform only.\nThanks", "Dear Student,\n\nyou need to fill the add/drop form. and send it on this portal only.\nyou can find the add/drop form in the mail shared by registrar before commencement of this semester.\nit is named as student registration guidelines.\nThanks.", "Dear Student,\n\nyou need to fill the add/drop form. and send it on this portal only.\nyou can find the add/drop form in the mail shared by registrar before commencement of this semester.\nit is named as student registration guidelines.\nThanks.", "Dear Student,\n\nyou can drop your course by filling out the add/drop form sent in the mail by Registrar in guidelines for registration.\nPlease fill the form and share it on this platform only.\nThanks", "Dear Student,\n\nyou can drop your course by filling out the add/drop form sent in the mail by Registrar in guidelines for registration.\nPlease fill the form and share it on this platform only.\nThanks", "Dear Student,\n\nyou can drop your course by filling out the add/drop form sent in the mail by Registrar in guidelines for registration.\nPlease fill the form and share it on this platform only.\nThanks", "Dear Student,\n\nyou can drop your course by filling out the add/drop form sent in the mail by Registrar in guidelines for registration.\nPlease fill the form and share it on this platform only.\nThanks", "Dear Student,\n\nyou can drop your course by filling out the add/drop form sent in the mail by Registrar in guidelines for registration.\nPlease fill the form and share it on this platform only.\nThanks", "Dear Student,\n\nyou can drop your course by filling out the add/drop form sent in the mail by Registrar in guidelines for registration.\nPlease fill the form and share it on this platform only.\nThanks", "Dear Student,\n\nyou can drop your course by filling out the add/drop form sent in the mail by Registrar in guidelines for registration.\nPlease fill the form and share it on this platform only.\nThanks", "Dear Student,\n\nyou can drop your course by filling out the add/drop form sent in the mail by Registrar in guidelines for registration.\nPlease fill the form and share it on this platform only.\nThanks", "Dear Student,\n\nyou can drop your course by filling out the add/drop form sent in the mail by Registrar in guidelines for registration.\nPlease fill the form and share it on this platform only.\nThanks", "Dear Student,\n\nyou can drop your course by filling out the add/drop form sent in the mail by Registrar in guidelines for registration.\nPlease fill the form and share it on this platform only.\nThanks"]}, "11": {"Patterns": ["Sir, I wanted to change my batch to EB-25 but due to some error it is changed to EB-21 sir please do change it to EB-25 coz I don't want to lose this opportunity. coz this is the last time we can change batch. please sir help me", "I know sir you can do this today", "because after that it won't be possible please sir", "And I know sir you are the only one who can do this", "please do it sir", "Sir, time is about to over please sir do it to eb-25", "I want to change my batch to EB 14 because i dont have any friends in my current EB 22 batch.", "I am getting the gaming specializations  course but i have choosen the cybersecurity course please help me ", "I registered a internship I did last year as my summer internship but the completion date range is set to be of this year. I have selected a random date for now. Can you look into this bug.", "I have dropped the Minor Entrepreneurship course a long ago and still it is showing in the course registration in Coll Poll due to which I am unable to complete the registration process, so please kindly remove this course from my id. ", "NOT ABLE TO REGISTER BECAUSE OF MY ENTREPRENEURSHIP MINOR IT IS ASKING ME TO TAKE THE CORE COURSE BUT I HAVE ALREADY DROPPED THE COURSE LAST SEM AND IT IS INTERFERING IN MY REGISTERATION SO PLS REMOVE THAT MINOR COURSE FROM MY REGISTERATION PORTAL", "Also i would like to know the procedure for sending Interim Transcripts to a foreign univerisity as it is required in order to confirm masters admission. (Sending Interim Transcirpts as PDF mail to a foreign uni. )", "pls help me asap because the registration is going to close", "it was updated by collpoll team but still the issue is not resolved it still shows the same when i try to add a open elective course ."], "Responses": ["Dear Student is it resolved now?", "Dear Student is it resolved now?", "Dear Student is it resolved now?", "Dear Student is it resolved now?", "Dear Student is it resolved now?", "Dear Student is it resolved now?", "Dear Student, this seems to be resolved i am closing this query", "Dear Student, this query has been resolved i am closing this", "issue resolved.", "Dear Student,\n\nKindly refresh and check it has been resolved.\nThanks,", "Dear Student,\n\nit is resolved now, you can refresh and check again\nThanks.", "As dissucsed issue has been resolved.", "Dear Student,\n\nit is resolved now, you can refresh and check again\nThanks.", "Dear Stydent,\nIt is resolved now, kindly refresh and check\nThanks"]}, "12": {"Patterns": ["During my course registration I can see a section of \"Minor Enterpreneurship Minor\" in which there is a core course which I have to take to complete my registartion but I don't want to take any course from that section so please remove it.", "I want to inform you that Coll Poll is showing an error during course registration as when I select all REGULAR CORE COURSES and ELECTIVES from course with minimum credits of 22.\nThen, the Specialization Part shows an error. ", "I have being trying to complete the registration for 2 days now. After adding the courses, when I click Complete Registration, it shows \"Please register for REGULAR programme Elective courses of programme list\". Kindly look in the matter.", "Good morning Sir/Mam, Even after attending, and putting my biometrics my attendance is not getting updated in my collpoll\nEnrollment number:E22CSEU1215", "I am attending regularly class but my colpoll is not updating my attendance.", " i am regularly attending my classes from the first day itself and also I had many approached collpoll many a times but i unable to find any solution ", " i am regularly attending my classes from the first day itself and also I had many approached collpoll many a times but i unable to find any solution .", "My collpoll app does not update my attendence for the the classes i attend.Kindly resolve my problem.", "My attendance is not getting updated on daily basis and is getting down day by day. Even after attending all the classes and marking attendance within 10 minutes after professors.\nSo, I request you to pleasee look into that ASAP.\n", "My attendance is not getting updated on daily basis and is getting down day by day. Even after attending all the classes and marking attendance within 10 minutes after professors.\nSo, I request you to pleasee look into that ASAP.", "I can see issues in my attendance record..I've even sent multiple requests to collpoll application..but i see no update. please check (Kshitiz Saxena E22CSEU0232)", "E22CSEU0350 Vivek Reddy\nMy attendance in collpol is showing less even though I have attended every class", " On outlook I am not receiving mails for maths tutorials and today for entrepreneurship assignment also I am not receiving mails. Both the times I got to know about these things from my batchmates before the tutorial and assignment respectively.\n", "course registration "], "Responses": ["Dear Student,  I m closing this quary as this problem has been resolved.", "Dear Student,  i am closing this quary as problem is already solved on CollPoll.", "Please share the SS of that problem .", "Dear Shivansh, I have acknowledged your query for attendance, once the problem is resolved we will let you know.", "Dear harsh,  I have acknowledged your query, collpoll will definetly response once the problem is resolved.", "Dear Kartik, I have acknowledged your query, collpoll will definetly response once the problem is resolved.", "Dear Kartik, I have acknowledged your query, collpoll will definetly response once the problem is resolved.", "Dear Roushan, I have acknowledged your query, collpoll will definetly response once the problem is resolved.", "Dear Akshat,  I have acknowledged your query, collpoll will definetly response once the problem is resolved.", "Dear Akshat,  I have acknowledged your query, collpoll will definetly response once the problem is resolved.", "Dear Kshitiz,  I have acknowledged your query, collpoll will definetly response once the problem is resolved, still regarding your attendance mail to Saphal Anand <saphal.a@collpoll.com>\n\nsupport@collpoll.com", "Dear Vivek, I have acknowledged your query, collpoll will definetly response once the problem is resolved. Also see that whenever you punch your name is displayed, this will assure you that your attendance is recorded.", "Also, after reinstalling your outlook, if the problem still persists, then kindly contact IT for your query.", "Dear Student,\n\nKindly elaborate your query as it is not clear what is the problem you are facing."]}, "13": {"Patterns": ["i have been facing issues which have been affecting my studies in this batch and would like to change batch so that i can perform better. ", "I would like to change batch from EB32 to EB11", "I want to change my batch from EB32 to EB05. I had bad experience the previous semester in the batch as most of my friends are from EB05", "I want to change my batch because i am not feeling comfortable in this batch and also i will become dayscholar from next or this mid semester and the friend whom with i will come to college is in EB30 so it will become easy for us to travel.", "Completely uncomfortable with the present batch.", "Not comfortable with my batchmates ", "I want to change my batch since I am not comfortable enough with my batchmates since our ideologies didn’t seem to match with each other. I would want to switch to EB19 since I am well known with the students there and can work easily with them.", "Sir, In batch change option I wanted to change my batch to EB-25 which was reflecting there but when I clicked on it. The page crashed and when I reload it, it was showing that my batch is changed to EB-21 but I wanted it to change to EB-25.", "This is what shown in app", "Sir, as you told us that batch change can only done once in entire degree program an I don't want to waste it due to some internet connection problem please sir do it to Eb-25 as I won't ask again to do so", "Please sir as I reported immediately to the concern officials please listen to my request", "I want to change my batch to EB 24 as I have selected data science as my specialization and most of the students in that batch have opted for same.", "I want to change my specialisation from CSET211: Statistical Machine Learning to CSET214: Data Analysis using Python ", "want to change to eb22", "sir all my friends, my rommate and mostly all the people I am familiar with are in Batch 36... so it would be easy for me to study or work in projects with people I am familiar with so please change my batch from 42 to 36", "sir I want to change my batch 34 to 33 becoz my brother is in 33 we want to study together ", "My enrollment no.is E22CSEU0997", "Sir/Ma'am I request that my batch be changed from B23 to B33, because I find myself more compatible with my friends in B33 rather than B23. I think it will also have a positive effect on my academics and mental health.\n\nthank you,\nPratham tiwari.", "i want to switch to batch 4", "i want to change my batch from batch 10 to batch 11 as majority of the people there are on my floor and its very convenient to go home on weekends when we have same timetable kindly change my batch from batch 10 to only batch 11 ", "How do I get my batch changed going forward in the 2nd sem. A formal application? but to whom? ", "I would like to change my Batch", "Name - Tanya Khera\nEnrollment Number - E21CSEU0659\nCurrent Batch - EB24\nNew Batch - EB25\nI would like to change my batch from EB24 to EB25", "please change my batch from 14 to 15 if possible, thank you.", "application for batch change", "how do i change my batch", "I want to change my batch to eb19", "I request you to pls consider my batch change now since I was having a flight while the portal was open. it was a very short period bcz of which many did not enroll", "I request you to pls consider my batch change now since I was travelling while the portal was open. it was a very short period bcz of which many did not enroll.", "I request you to please consider my batch change now since I was travelling while the portal was open. it was a very short period, and the time given was to short because which many did not enroll.", "I request you to pls consider my batch change now since I was having a traveling while the portal was open. it was a very short period because of which many did not enroll..", "My current batch is EB06 and I would like to request to change it to EB24. I had a conversation with the class BR and Neeti Mam, I got to know few students left the batch and hence the vacancy in it. Environment in EB24 will definitely help me grow.", "The portal was open for a very limited time! It was not possible for many of us since people did not just travel bye train but flights as well. The timing must've been a bit more exceeded if it was open just for a day !", "I want to change my batch from eb07 to eb19 is it possible now? Can you please revert back if it is still possible.", "According to the mail and sent by Deepak sir 'Batch Change' was supposed to be in the tray, I tried to find it in the given time frame but couldn't. It was later when I opened the 'Acad queries' where I found it as an option. Kindly reconsider.", "Dear Sir,\nI want to change my batch from EB-25 to EB-28 but it was showing batch strength full at time I was trying to change. Now , I get to know from my friends that 2 student left batch and their strength remained 28 . so, please allow me.", "From eb27 to eb08", "I want to switch batches to EB09, since i have an internship and my timetable alignes better with EB09 i wish to change my batch", "Respected sir/mam,\n\nI have requested for batch change it showed approved in the app but not yet updated in collpoll and I haven't received approved mail to  my outlook please help me out\n\nThank you.", "I had kept a request in this app to change my batch on 16 jan2023.can you please say when will it reflect on collpoll or get a confirmation mail regarding that."], "Responses": ["Dear Student,  Batch Change Requests will start from Tuesday (9th August) at 9AM to 9PM only. where you can select the available batches.", "Dear Student,  Batch Change Requests will start from Tuesday (9th August) at 9AM to 9PM only. where you can select the available batches.", "Dear Student,  Batch Change Requests will start from Tuesday (9th August) at 9AM to 9PM only. where you can select the available batches.", "Kindly raise your request through batch change option in your CSEBU webapp", "Dear Student,  Batch Change Requests has started today from 9AM to 9PM only. where you can select the available batches. Kindly select the required batch now.", "raise your request through batch change option on your app", "you need to request on batch change function only please check your app and opt for batch change option", "Dear Student, it is not possible now to change it further", "Dear Student, it is not possible now to change it further", "Dear Student, it is not possible now to change it further", "Dear Student, it is not possible now to change it further", "Dear Student, Batch change window has already been closed, it was only possible through the app in that window only", "Dear Student change of Specialization is not possible now", "Dear Student, Batch change is not allowed now in this semester you can change it in next Semester", "Batch  change is not possible, as there is no vacancies in any batch. If availability is there you will get an option in next semester, as well as you will be infromed in collpol.", "Dear Sahil, I am really sorry as batch change is not possible, still you can wait for the next semester, if any vacancies are generated  then you can see on collpol.", "Dear Sahil, I am really sorry as batch change is not possible, still you can wait for the next semester, if any vacancies are generated  then you can see on collpol.", "Dear Pratham,  I understand, but my dear there is no vacancy in any batches right now, in next semester that is in January, if there is any vacancy in that batch then definetly we will change. Till then stay positive.", "Dear Dhruv, Batch change is not possible. You will be intimated when options will be open.", "Dear Rudraksh, Batch change is not possible, we will let you know if there is any option.", "Dear Shobit, Batch change has not started yet, we will inform everyone once its open also the process to apply for change.", "dear kancharla, Batch change requests will be accepted from CSET Webapp on 16th January Time: 3 PM to 6 PM only if the target batch student count does not go beyond 30.", "Dear Student,\n\nBatch change application will open on CSET Webapp on 16th January from 3 PM to 6 PM", "Dear Pratibha, Batch change window will be open on CSET Webapp on 16th January from 3 PM to 6 PM.", "Dear Student,\nBatch change window will open on Monday from 3 to 6 PM on CSEBU Webapp.", "Dear Student,\n\nBatch change window has been closed as directed in the mail it was open from 3 to 6 PM today.\nThanks", "Dear Student,\n\nBatch change window has been closed as directed in the mail it was open from 3 to 6 PM today.\nThanks", "Dear Student,\n\nThe batch change window was open from 3 PM to 6 PM on 16/01/23\nNo request of batch change is possible now.\nyou can try in next semester.\nThanks.", "Dear Student,\n\nThe batch change window was open from 3 PM to 6 PM on 16/01/23\nNo request of batch change is possible now.\nyou can try in next semester.\nThanks.", "Dear Student,\n\nThe batch change window was open from 3 PM to 6 PM on 16/01/23\nNo request of batch change is possible now.\nyou can try in next semester.\nThanks.", "Dear Student,\n\nThe batch change window was open from 3 PM to 6 PM on 16/01/23\nNo request of batch change is possible now.\nyou can try in next semester.\nThanks.", "Dear Student,\n\nThe batch change window was open from 3 PM to 6 PM on 16/01/23\nNo request of batch change is possible now.\nyou can try in next semester.\nThanks.", "There is no scope now as the system was automated and it has been locked.\nyou can try batch change in next semester.\nThanks.", "Dear Student,\n\nThe batch change window was open from 3 PM to 6 PM on 16/01/23\nNo request of batch change is possible now.\nyou can try in next semester.\nThanks.", "There is no scope now as the system was automated and it has been locked.\nyou can try batch change in next semester.\nThanks.", "Dear Student,\n\nBatch change window was open from 3 PM to 6 PM on 16/01/2023.\nnow it has been closed and any change is not possible.\nThanks.", "Dear Student,\n\nBatch change window was open from 3 PM to 6 PM on 16/01/2023.\nnow it has been closed and any change is not possible.\nThanks.", "Dear Student,\n\nThe batch change window was open from 3 PM to 6 PM on 16/01/23\nNo request of batch change is possible now.\nyou can try in next semester.\nThanks.", "Dear Student,\n\nThe batch change window was open from 3 PM to 6 PM on 16/01/23\nNo request of batch change is possible now.\nyou can try in next semester.\nThanks.", "Dear Student,\n\nThe batch change window was open from 3 PM to 6 PM on 16/01/23\nNo request of batch change is possible now.\nyou can try in next semester.\nThanks."]}, "14": {"Patterns": ["requesting for the marksheet of sem 1 and sem 2 for BTech CSE 2021-25 batch", "Sir, I'd like to know about the status of the Marksheets of 1st and 2nd sem and also the 1st year collectively. \nI raised a ticket in the past as well but received no response. looking forward a reply this time.", "Requesting to get my marksheet as my parents are asking for it Thank You", "Respected Sir/Ma'am \nI am unable to appear for mid semester because my right wrist have a cramp and swelling and pain. My doctor prescribed me to take rest as I was unable to write . Right now I'm at my home. How can I apply medical ", "Sir/ Ma'am \nI had emailed my medical to soni.nehra@bennett.edu.in\nSudeepta.chauhan@bennett.edu.in\nakhil.mishra@bennett.edu.in\nPlease make me aware what to do next.", "The makeup examination is permissibe under which options?\n\nSir, here, I can't see after your message \"The makeup examination is permissibe under the following options\"", "As a scholar of the WE program by Google and TalentSprint, I'm required to attend a bootcamp from 17th to 29th December, due to which I'll miss Statistical Machine Learning End-Semester Examination. Please allow me to attempt the exam after 30th.", "Alright, thank you! Will applying for make-up exam result in reduced marks (like will I be evaluated out of 70 instead of 100 for example) in any form? Will it affect my scholarship in any way?", "Missed -Probability and Statistics-CSET204, END TERM Exam due to family Emergency(GrandMother Death) and Medical Illness Due to tradegy in family.(Fever, Stomach Pain, Weakness).", "What is the last date to apply for Make-Up Odd Semester Examination?", "I missed the Microprocessors exam for 2nd year.", "I am Anant Khurana, I want to enquire about the dates of makeup examination as I missed the exam on 16 of December because I went out for AIU(A north zone tournament) that took place in Punjab, representing the university .", "Ok so I am sending you the list with the stamp of hod of sports my name and enrollment number are\nAnant Khurana \nE21CSEU0084", "I am Parv Shivhare, A 2nd year btech student, I want to apply for my missed end term examination as i was on University duty, that is our Bennett Football team, we left the same day as my Data science exam, please let me know the procedure, proofatcd", "CSET-214\nData analysis using python", "I am Akhil Dalal.\nI want to enquire about the date for makeup examination of data science as I missed the exam on 16th of December as I went out for AIU (A north zone tournament) in Punjab, representing Bennett University in football.", "Due to medical issues i am unable to give End term enterpreneur exam Kindly consider it for and provide me best for same.", "i want last semester marksheet as I need to submit it in AIU cricket tournament . please provide me as soon as possible ", "i want last semester marksheet as I need to submit it in AIU cricket tournament . please provide me as soon as possible ."], "Responses": ["Kindly contact Examination Department and your respective Mentor", "Dear Student, Apologies for delayed response, you need to ask the same to Examination Department.", "Dear Student, for marksheets you can contact to Examination Department.", "Dear Sumit, Sorry to hear about your wrist, we wish you speedy recovery. Regards to the Makeup Examination for the ongoing midterm examinations (1st-year students, all programs). The makeup examination is permissible under the following options:   The fol", "Dear sumit, We have received your mail, you will be shared a makeup exam form by your program coordinator by today or tomorrow. for the time being you can go through the procedure for Makeup", "The following are the provisions to avail a makeup examination.\n1.\tHealth (Hospitalization)  The Student needs to apply, and a Recommendation/Justification by BU Medical Officer is mandatory\n2.\tRepresenting University in an event (pre-approval)", "Dear Student,\nyou can apply for makeup Examination for your missed Examination. \nyou will be recieving the notification regarding the makeup Examination by Examination Department only, you can apply for makeup Exam within 5 days from last Exam.", "Makeup Exam is a replica of your final Exam only, the marks assigned to end term evaluation would be same in Makeup Examination.\nIncase you fail to attend Makeup or not approved in that case only it will get affected.", "Dear Student,\n\nYou can avail a makeup Examination with Approval of Dr. Soni Nehra (BU inhouse medical officer) on medical grounds.", "Dear Student,\n\nyou can apply till 25th Dec EOD with all the relevant Documents.", "Dear Student,\n\nyou can apply for Makeup Examination till 25th Dec EOD with all the relevant Documents.", "Dear Student,\n\nyou can apply for Makeup Examination till 25th Dec EOD with all the relevant Documents.", "Your Makeup Request is submitted for further approval and you will be informed about the status.", "Dear Student,\n\nYou want to appear for makeup Examination in which course?", "Your request is already submitted and you will get a mail regarding your examination Shortly.\nThanks.", "Dear Student,\n\nYou want to appear for makeup Examination in which course?", "Dear Student,\n\nLast date to apply end term makeup has already passed.\nand to apply you need to take the approval of BU Medical officer first by mailing her then it is taken further.", "Dear Student,\nPlease find attached File of your last semester scores.\nfor complete  gradesheet you need to contact Examination Department at Coeoffice@bennett.edu.in\nThanks", "Dear Student,\nPlease find attached File of your last semester scores.\nfor complete  gradesheet you need to contact Examination Department at Coeoffice@bennett.edu.in\nThanks"]}, "15": {"Patterns": ["As per the scheme, the AI students needs to take CSET301 and not add CSET208 and Specialization core 2 in semester 4 for that I wanted to confirm that do we have to add or not add CSET208during course registration.", "For AI specialization students CSET208 and specialization core 2 will run in semester 5 and CSET308 will run in semester 4 as shown in the given image. So, do I as an AI specialization student have to skip adding CSET208 during course registration?", "Hi There, \nI have Artificial intelligence as a specialization.\nToday during registeration I got an error that i have to select all the regular core courses but the our specialization core is of 5 credit and we have to disselect CSET208. Please update", "As mentioned in the B.Tech. Scheme provided to us, AI specialisation students have to take CSET301 in semester IV and Specialization Core+CSET208 will run in semester V. While registering, it is not accepting the registration without adding CSET208.", "While registering for my second year even sem I am facing an issue, after selecting all the courses and entering register it is showing me a warning asking me to register for all regular core courses for my specialisation but I have already done that", "I have opted all the courses excet the core course of minor in entrepreneurship, but I already dropped that minor last sem so that's the only course am not opting and it is showing me the above issue", "Registration errors due to CIE entrepreneurship minor still being visible after being dropped in the previous semester", "Sir my Grade Point is A", "i have dropped the entrepreneurship course last semester but it is still showing in my collpoll. due to which im unable to do the course regestraion completely", "i raised a ticket regarding my problem,\"Due to the CIE course, i'm not able to do my registration though i have already dropped that minor previous semester, so please remove that course from my portal\", i request you to please solve this problem.", "Acadquery: Add/drop course", "I have already sent the form", "In the attachment", "Myself sakshi goyal BR of EB22 have changed the batch. So I request you to elect the BR for EB22."], "Responses": ["Dear Student,\n\nKindly continue with the Course Registration, the Ethics course can be removed once your registration is done.\nThanks,", "Dear Student,\n\nKindly continue with the Course Registration, the Ethics course can be removed once your registration is done.\nThanks,", "Dear Student,\n\nKindly continue with the Course Registration, the Ethics course can be removed once your registration is done.\nThanks,", "Dear Student,\n\nKindly continue with the Course Registration, the Ethics course can be removed once your registration is done.\nThanks,", "Dear Student,\n\nKindly proceed with your course registration by opting all the courses.", "Dear Student,\nMinor Specialization has been removed from your profile, you can now refresh and proceed with the course registration.\nThanks.", "Dear Student,\n\nCourse has been removed from your Specialilzation.\nyou can now proceed with your registration process.\nThanks.", "Dear Student,\nit is done, kindly refresh and check again.\nThanks.", "Dear Student,\n\nit is done now, you can refresh and check again\nThanks.", "Dear Student,\n\nit is done, you can now refresh and proceed with your course registration.\nThanks.", "Dear Student,\n\nit is done, you can now refresh and proceed with your course registration.\nThanks.", "Yes, it will be done", "Yes, it will be done", "Dear Student,\nThanks for informing, this has been done."]}, "16": {"Patterns": ["I want to drop minor course of entrepreneurship.", "I want to drop minor course for entrepreneurship and change my open elective", "I want to change my open elective from Search engine optimization to advanced skill enhancement ", "This is regarding the course that is CSET-231(Programming Methodologies for Backend) is not visible on my LMS. That particular course is not visible so that's why I am not able to submit my any assignments. So kindly look into this matter.", "Academic Fee is paid and Courses are Registered but CSET301: Artificial Intelligence and Machine Learning is not visible on LMS.", "2 courses - CSET301 and CSET487 are not visible on my LMS. Instead, CSET208 is visible, which the AI specialisation students are not supposed to take in this semester.", "\nadd EPHY384L & drop CSET208 ethics", "Add digital marketing and drop ethics", "Please change my open elective from digital marketing to sociology of gender", "I would want to change my open elective from CSET489 SEO to CSET382 Web Technologies. I completed my registration on 10th and other course options were added later. I am attaching the proforma, kindly change my open elective.", "Open elective course to be DROPPED: CSET492 (Advanced Skill Development)\n\nReason: Already mapped\n\nName: Soham Datta\nBatch-EB07\nE21CSEU0980", "Sir is it done?", "Changing the course", "Changing elective ", "Enrollment number = E21CSEU0895\nCourse code= CSET231\nCourse Name = Programming Methodologies for Backend Development\t\nThis course is not visible on my lms. Please help me", "unavailability of the time table of DR.Aditya Bharadwaj on scset webApp.", "Name: Manu Chaitanya\nCourse CODE: cset231\nCourse Name: Programming Methodologies for Backend Development\nThis course is not visible on LMS .Please Help me", "I switched from the EB09 batch to the EB05 batch, but when I go to submit my assignments, it still shows EB09 submission."], "Responses": ["Dear Student,\n\nYour request has been received and your course will be updated shortly.\nThanks.", "Dear Student,\n\nYour request has been received and your course will be updated shortly.\nThanks.", "Dear Student,\n\nYour request has been received and your course will be updated shortly.\nThanks.", "Dear Student,\n\nYour request has been received and your course will be updated shortly.\nThanks.", "Dear Student,\n\nYour request has been received and your course will be updated shortly.\nThanks.", "Dear Student,\n\nYour request has been received and your course will be updated shortly.\nThanks.", "Dear Student,\n\nYour request has been received and your course will be updated shortly.\nThanks.", "Dear Student,\n\nYour request has been received and your course will be updated shortly.\nThanks.", "Dear Student,\n\nYour request has been received and your course will be updated shortly.\nThanks.", "Dear Student,\n\nYour request has been received and your course will be updated shortly.\nThanks.", "Dear Student,\n\nYour request has been received and your course will be updated shortly.\nThanks.", "Dear Student,\n\nYour request has been received and your course will be updated shortly.\nThanks.", "Dear Student,\n\nYour request has been received and your course will be updated shortly.\nThanks.", "Dear Student,\n\nYour request has been received and your course will be updated shortly.\nThanks.", "Dear Student,\n\nYour request has been received and your course will be updated shortly.\nThanks.", "Dear Student,\n\nYour request has been received and your Query will be resolved shortly.\nThanks", "Dear Student,\n\nYour request has been received and your course will be updated shortly.\nThanks.", "Dear Student,\n\nYour request has been received and your course will be updated shortly.\nThanks."]}, "17": {"Patterns": ["But as per the catalogue received LTP component was 3-0-2", "And we have D.S lab on Monday and Tuesday", "Alright, thank you!", "sir I want to drop my course of CIE201L foundation and Entrepreneurship and I have attached my drop form.", "Ok sir/ma'am...\nThank you ", "Ok thank you", "Ok sir/ma'am... Thanks...", "Alright. Thank you! That's all I needed to ask.", "Thank you Sir.", "Thank you so much for your acknowledgement", "Still no response", "thanks", "Yes it's done sir... thank you sir"], "Responses": ["I hope the query has been resolved", "I hope the query has been resolved", "I hope your query is resolved, I am closing this query.\nyou can raise a new ticket in case of another query.\nThanks,", "Dear Student, your course has already been dropped.\n I am closing this query, incase of any other query you can raise another ticket.\nThanks.", "I hope this query is resolved,\nI am closing this query incase of any other Query you can raise a new ticket.\nThanks.", "I hope your query is resolved so i am closing this query, incase of any other query you can raise a new ticket.\nThanks", "I hope your query has been resolved, I am closing this query.\nincase of any other Query you can raise a new ticket.\nThanks.", "I hope your query has been resolved, I am closing this query.\nincase of any other Query you can raise a new ticket.\nThanks.", "I hope your query has been resolved, I am closing this query in case of any other query\nyou can raise a new ticket.\nThanks.", "I hope your query has been resolved.\nI am closing this query incase of any other query you can raise a new ticket.\nThanks.", "Dear Student,\n\nI hope your query has been resolved.\nI am closing this query incase of any other query, you can raise a new ticket.\nThanks.", "I hope your query has been resolved,\nI am closing this query in case you have any other query kindly raise a new ticket.\nThanks.", "Dear Student,\n\nI hope your query has been resolved.\nI am closing this query incase of any other query, you can raise a new ticket.\nThanks."]}, "18": {"Patterns": ["Respected Sir,\n\nGood Afternoon, I would like to request you that I want to change my respected batch from EB08 To EB05.\nThe following are the reasons mentioned in the image attached.\n", "batch change ", "I want to change my batch", "batch Change", "No options of batches available", "Want to change my batch from EB-28 to EB-23", "I have been dealing with some issues with the current batch affecting my academics as well hereby I want to change my batch ", "Batch change from EB18 to EB06", "I am batch EB-17 student and want to go to batch EB - 14", "Respected sir/ma'am,\n\nWith due respect I would like to know when will the Batch Change option be available for students.\n\nRegards\nMahim Agarwal\nE21CSEU0401", "It is a request to provide course details of all the open electives being offered. Most of the details are not there in the course curriculum provided. "], "Responses": ["Dear Student, you are requested to kindly refer the mail shared by dean Sir today and apply at that time only.", "Dear Student kimdly refer to the mail shared by Dean Sir today and raise your request at that time only through batch change functionality on CSEBU webapp", "Dear Student, kindly refer to the mail shared by dean Sir today and raise your request accordingly", "Dear Student kindly refer to the mail shared by dean Sir today regarding Batch change", "Dear Student kindly refer to the mail shared by dean Sir today regarding Batch change", "kindly refer to the mail shared by dean Sir today regarding batch change", "Dear Student, regarding batch change kindly refer to the mail shared by dean sir today", "Dear Student, Kindly refer to the mail shared by Dean Si regarding Batch change", "Dear Student, Kindly refer to the mail shared by dean Sir regarding batch change", "Dear Student,\n\nyou will recieve a mail regarding batch change in 2nd Week of January from Dean Sir.\nyou have to apply for CSEBU Webapp only at the time when you will recieve notification.", "Dear Student,\nit will be shared today with all the Students"]}, "19": {"Patterns": ["As per the summer training email students could go for skill enchancement training in place of an internship, but the summer training evaluation is specific to internships. How would someone who has gone for skill enchancement submit the same", "\nI have opted for internship elective this semester and I had to add the open elective just to complete my registration. Open Elective I want to drop - ( Applications of AI) [ CSET381] \nThe same query has been raised in colpoll as well by me. ", "I want to drop Applications of AI CSET381 from my regestration as i was not able to register without adding one Elective", "E19CSE060 Pratham Sharma", "i am a 4th year(7th sem) btech CSE student and I want to drop application of AI course which is an open elective as I will be doing an internship for 6 months", "I wanted to change my batch from EB10 to EB02 but the option is mot available. My all the teammates for Capstone project is in EB02 . It's becoming difficult for me to manage as Capstone is the biggest project of the complete course.", "Any update?", "I want to DROP my OPEN ELECTIVE namely AI and Public Policy(ECSE388L) and just do the Practical Internship of 14 credits for my 7th Semester.\nI have placed the Drop Request on CollPoll with Request ID 45546.\nMy registration & drop form is attached.", "Regarding Summer Training Details: I have done over 240 hours of course-work which was given as one of the options for summer training ", "I want to drop my elective. but i am unable to do it from collpoll.What is the process for droping.Can you please look into the matter.", "Respected sir, I am Namburu Sai Srinivas Vitesh from b.tech 4th year. Can you please remove  or ignore my friend's osmosys software solutions submission with sr.no 1 and consider my jv technologies internship with sr.no 2 as the correct one.", "At the time of the internship midway report, I had a different mentor assigned to me and now I have a new mentor for the past month or so. I wanted to clarify whose details do I enter into the mentor details tab"], "Responses": ["As discussed query has been resolved.", "As discussed query has been resolved.", "As discussed query has been resolved.", "As discussed query has been resolved.", "As discussed query has been resolved.", "As discussed query has been resolved.", "As discussed query has been resolved.", "As discussed query has been resolved.", "As discussed query has been resolved.", "As discussed query has been resolved.", "As discussed query has been resolved.", "As discussed query has been resolved."]}, "20": {"Patterns": ["I am not getting the reffreing college decreased fees and also my father is i  defence also nit getting that scholarship  and my sister in  in same batch also i need that scholarship ", "My name is Ankit Dubey and my roll number is E21CSEU0184.Due to delay in passing the loan from the bank the remaining fees of my hostel and tution fees will be delayed by 4 to 5 days so I request you to give me extension from 9/08/2022 to 12/08/2022", "we have already deposit the amount of 1,23,750 Rs.", "Dear sir/mam, \n                   I am facing an issue regarding the payment of fees. My hostel fees is not reflected on collpoll. So, please make me enable to pay my fees. I hope u will resolve this problem.", "Dear sir/mam,  \n                   I am facing an issue regarding the payment of fees. My hostel fees is not reflected on collpoll. So, please make me enable to pay my fees. I hope u will resolve this problem.", "Not able to make fee payment on collpoll , It fails ", "I have paid my fees tommorow with hostel charges through rtgs \nOn collpoll is showing succefull but with sport charges option and my hostel is shown cancelled \nI am attaching screenshots.\nRegards,\njatin", "my data science specialisation not showing in lms", "I uploaded my initial goal report of 7th semester internship on the portal and it was visible on the portal. Today, when I opened the portal for uploading my mid-way internship report my initial goal report was not there. Please kindly check.", "My mentor is unable to give evaluation marks, it's producing an error saying, Company Mentor not found, kindly check asap.", "I want semester wise fees structure for loan application\n\n", "some of my courses are not available and in cse course the content in it is Missing ", "In LMS.", "Hello,\nI am a student of b.tech second year of enrollement number:- E21CSEU0412 \nI just want to know the fees I have to pay in the fourth semester. \n\nThanks, and Regards\nManoranjan Kumar", "I did my clearance yesterday, so today I want to change my I'd card to day schoalr", "I did my clearance yesterday, so today I want to change my I'd card to day scholar", "finance and fees related ", "respected sir/ma'am,\ni would like to request the concern department to give me time for submission of my 50 percent fees by End of this month(feb).\nkindly consider this ticket as request for help in hard times for my family and me. \ngayatri\nthankyou\n", "please tell me the exact amount to pay the academic and hostel fees. i think the amount which is showing on collpol is not accurate. please tell me asap", "regarding fees"], "Responses": ["Kindly contact to registration Department regarding scholarship related issues", "Dear Student, you need to contact to finance department regarding fee related issues", "Dear Student, you need to contact to finance department regarding fee related issues", "Dear Student, Kindly contact finance department regarding fees related query", "Dear Student, Kindly contact to finance department regarding fees related query", "Dear Student, Kindly report to Collpoll support and finance department", "Dear Student, anything related to fee is the domain of finance department, kindly consult the department", "It will be visible by today, if the issue still pertains kindly contact to Mr Shakti Singh.", "Today i have tried contact with you but your mobile no was switch off so kindly contact to me ASAP.", "Dear Student, kindly contact to Mr. Tarun (Contact number - 7827129373)", "Dear Student,\n\nKindly consult with Finance Department Regarding Fee related Query.\nThanks.", "Dear Prabhav, Kindly contact Mr. Shakti Singh <shakti.singh@bennett.edu.in> he is available at lab B LA 108", "Dear Prabhav, Kindly contact Mr. Shakti Singh <shakti.singh@bennett.edu.in> he is available at lab B LA 108", "Dear Student,\n\nyou need to contact to finance department for any fee related query,\nkindly write to Finance@bennett.edu.in\ndivya.agrawal@bennett.edu.in\n\nThanks.", "Dear Student,\n\nKindly contact at Finance@bennett.edu.in\nDivya.agrawal@bennett.edu.in", "Dear Student,\n\nKindly contact at Finance@bennett.edu.in\nDivya.agrawal@bennett.edu.in", "Dear Student, Please reach out to Finance department in person for \"fee dues/any updation/any finance related query/to claim refund if any\".", "Dear Student,\n\nThis query directly comes under finance department, \non this platform you are supposed to raise your academic queries.\nKindly write to: - finance@bennett.edu.in\ndivya.agrawal@bennett.edu.in", "Dear Students,\n To facilitate quick and prompt resolution of queries related to Fee /Finance, we would emphasize that you raise your query/ issue on the online helpdesk. \nYou are advised to log in to  https://helpdesk.bennett.edu.in/open.php", "Dear Student,\nFor any Query related to Finance kindly contact at finance@bennett.edu.in or Divya.agarwal@bennett.edu.in \nThanks"]}, "21": {"Patterns": ["My fathers collpoll account is showing that it is deactivated how to activate please help i am attaching  that what is showing in it", "When can we register for minor or honours courses and in which subjects ?", "I have recently changed my specialization elective from Big Data Analytics to Data visualization and Dashboards but the change is not reflected on my LMS.", "I am in G4-Batch. I want to attend G5 class (only CSET202 course lectures) . they are on same time only. I am not able to understand G4 teacher and well versed with G5 teacher. \nthe main issue is the quizzes which are in class. thanks", "i didnt did the course registration so i am not able to see any specialization course", "Please look into it. ", "Look into it sir", "Still sir it won't be much comfortable for me. Please find if there is any other alternative. Thankyou", "Hello sir/mam this side SUMIT YADAV, i want to ask you that i am suffering from very high fever and doctor recommended me to take bed rest for 4-5 days, so my query is that can i give medical to the college so that i can get my attendence preserved.", "can we postpone the dates of mid sem becoz most of the students have very late admission if it is possible then please do this ", "Everyday, we have a class at 8:30am. Please change at least 2 of them.", "Everyday we have a class at 8 30 am. Please change at least 3 morning classes.", "batch 17 classes  starts from 8:30 A.m.  evey working day we need atleast one day in a week where we can have our classes start from around 9:30 am", "Respected one, I humble request behalf of one-third 1st year students of bennett to postpone the mid term exams. There are many students who joined recently and who join previous are unable to cope up with the schedule. ", "What is the criteria to continue scholarship?", "course changefrom BTECH-CSE to BBA", "I want to know that for scholarship maintenance, our grades of each semester would be considered yearwoae or semester wise.", "Yes", "Will The Attendance be taken From Second Week of Classes or The First Week Itself", "As per our course catalog we have to deselect CSET208 as it will covered in our next semester.\nPlease update the following in the CollPoll so that we can complete our registration on time", "Thanks for Resolving my Query", "Sir,\nMy open elective is biological machines course code EBTY183L in the timetable given today no details are mentioned about it,how can I know when and where the class takes place?", "Clashing of LABA220L & CSET487", "what is the procedure for course drop", "i want to change my elective from ANDROID APPLICATIONS USING KOTLIN to DIGITAL MARKETING", "Changing open elective from ANDROID APPLICATIONS USING KOTLIN "], "Responses": ["Dear Student you need to raise your query to IT Dept and CollPoll Support", "you can register for Minor Course 3rd Semester onwards, and Honors 5th Semester onwards", "Dear Student, It will be visible on LMS this week.", "Dear Student, you need to contact your mentor first regarding this issue and then the program chair of Btech - Dr Manish Raj", "Dear Student, you need to register first so that you can see your specialization courses on CollPoll", "Dear Student, you need to contact your mentor first regarding this issue and then the program chair of Btech - Dr Manish Raj", "Dear Student, you need to contact your mentor first regarding this issue and then the program chair of Btech - Dr Manish Raj", "Its not possible", "Dear Sumit, Sorry to hear that dear, you can get yourself checked medically by Dr. Soni in Wellness centre and submit that copy to Dr. Manish Raj for reference. But to  tell you, there is no particular process for medical leave or any other leave. As per ", "Dear Aditya, its not possible, we have a fix schedule.", "Dear satvik, Its not possible, and need not keep any concern regarding Timetable. Please follow whatever is scheduled.", "Dear Dushaynt, Its not possible, and need not keep any concern regarding Timetable. Please follow whatever is scheduled.", "Dear Prateek, Its not possible, and need not keep any concern regarding Timetable. Please follow whatever is scheduled.", "Dear Praveen, we have a fix schedule to follow, therefore exams will not be postpone.", "Dear Rajat, you have to maintain minimum 8 CGPA throughout, and cannot fail in any semester to continue Scholarship.", "Dear Sree Charan Maddula, For changing from Btech CSE to BBA, you need to mail to hitankshi.thukral@bennett.edu.in and cc to deepak.garg@bennett.edu.in , n.chattopadhyay@bennett.edu.in , sudeepta.chauhan@bennett.edu.in , akhil.mishra@bennett.edu.in", "Dear Nilay, CGPA needs to be maintained semester wise, also no backlogs should be there. You need to be all clear throughout.", "ok then, do as i said, ifnot then contact IT.", "From first week onwards, attendance will be counted", "It will be removed during the first week of Semester itself.\nThanks.", "It will be removed during the first week of Semester itself.\nThanks.", "Dear Student,\nIt will be shared by eod", "Dear Student , It has been solved , Thanks for your coorporation.", "dear sahil, for first year there is no procedure for course drop. for any explanation or difficulty kindly meet your program coordinator.", "Dear Karan, Kindly contact your Program Coordinator", "Kindly contact your program Cordinator, Mr. Nikhil Mishra"]}, "22": {"Patterns": ["Does the scholarship cycle refresh each year?", "will we have our mid sem in November ", "There is a lot of gap between the gate and floor due to which there are a lot of mosqitoes in room!! Please fix it as early as possible", "Please change the study table in my room it's broken and it's very small!!", "Please fix door of the room there is some gap in the end and it's very uncomfortable..", "Winter Vacation and Endsem Date", "Wanted to know at what time end sem exam will be finished on 30th Dec as I have to book my flight tickets accordingly. I want to book a flight scheduled at 7:40pm means I have to leave college 4 hours before . So exam timing of End sem?", "Vacation Date Query", "When is the commencement of the Btech CSE 1st 2 nd Semester after winter Vacation...as in the Academic Calendar there is no **Teaching** day in the Month of January..but a heading of Commencement is Given on 16 th Of January 2023"], "Responses": ["Yes, it gets updated after every academic year", "probably yes, and also you will get an intimation. Kindly refer academic calendar.", "Dear Akshit, this platform is for academic queries, kindly approach to Dean Student affairs or admin department for your mosquitoes.", "Dear Akshit, this platform is for your academic queries, kindly approach to dean student affairs, or admin department for your Hostel problems.", "Dear Akshit, this platform is for your academic queries, kindly approach to dean student affairs, or admin department for your Hostel problems.", "Dear Abhisek, kindly check the academic calendar for your winter vacation and dates, also i am attaching the academic calendar for your reference.", "Dear Abhisek, kindly check the academic calendar for your winter vacation and dates, also i am attaching the academic calendar for your reference.", "Classes will be starting from 16th Jan 2023, as the date is tentative, its not been mentioned as teaching day. Winter vacation will start from 31st dec 2022", "Dear Sparsh, Classes will be starting from 16th Jan 2023, as the date is tentative, its not been mentioned as teaching day. Winter vacation will start from 31st dec 2022"]}, "23": {"Patterns": ["I had to do my registration but when I select the courses which I have to do with all requirements, It shows that please select the regular courses of the specialization i.e. Artificial intelligence.Please fix this issue \nRegards,\nTanishq Agarwal", "What is the status?", "minimum should be 26credits\nbut after choosing all mine was still 25 that's y i couldn't register ", "campus help center or outpass not working in collpoll", "Due to health issues. I was unable to give mid term exam kindly allow me to make up  of CBCA101 (Digital Design).\nMadhav Khatri \nE22BCAU0095", "Minor grade was not supposed to be calculated in total sgpa but here in my case, it is.", "I'm unable to register as registration option is not visible in my collpoll.", "I do not see the option for course registration on collpoll", "While registering on collpoll it shows with a error message for adding backlog course that i want to do in summer semester and i cannot move forward with the course registration without adding the course ,I have a minor course too so i cant add bcklg", "I am unable to register courses on CollPoll. Unable to do Course Registration."], "Responses": ["Dear Student you are requested to contact Collpoll , CoE Department. Mail them on support@collpoll.com , coeoffice@bennett.edu.in and put me in cc ( kamal.singh@bennett.edu.in).", "Dear Student, you need to write to kundan rawat, he is the concerned person for this.", "Dear Studdent, if you have the screenshot of the same kindly write  at support@collpoll.com and saphal.a@collpoll.com cc to nikhil.mishra@bennett.edu.in", "Kindly write to support@collpoll.com", "Dear Student, Write to Dr. Soni(soni.nehra@bennett.edu.in).", "Dear Student,\n\nKindly raise the issue with COE Department.\nwrite to Coeoffice@bennett.edu.in or COE@bennett.edu.in", "Dear Student,\nKindly write at-\nRegistry@bennett.edu.in\nChetna.Pargai@bennett.edu.in\nSupport@collpoll.com\nsaphal.a@collpoll.com\n\nThanks.", "Dear Student,\n\nKindly contact to regitry department,\nyou can write to registrar@bennett.edu.in\n and support@collpoll.com", "Dear Student,\n\nKindly write at Support@collpoll.in \nSaphal.a@collpoll.in", "Dear Student,\n\nKindly write to support@collpoll.com\nsaphal.a@collpoll.com"]}, "24": {"Patterns": ["Opted for Data Science, showing ui/ux on Collpoll while registering.", "Request to change specialization , Sir , I had filled the specialization as Blockchain , but I want to change it to full stack , I understand change is not permitted , but Sir , please the specialization is very important aspect in shaping my future ", "i was not able to take Specialization and that time i even mailed immediately but I didn't get a reply", "Our specialisation core contains 4 credits which includes 3 contact hours of lecture and 2 contact hours of practical but as per the time table received on date 21/08, it says we are having 4 contact hours of practical. ", "I want to change my specialisation from CSET211: Statistical Machine Learning to CSET214: Data Analysis using Python. ", "I want to change my specialisation from CSET211: Statistical Machine Learning to CSET214: Data Analysis using Python.", "Cant enroll to coursera bennett program due lack of availability", "Coursera Join program is not available, logged in from college email ID; error meassage: \"Sorry, this program has been filled up. Please contact your learning team to add availability.\n\n\"", "I am not able to enroll in any coursera certification course even after having the license right now. I am eligible to a license from 6pm to 6am till 20th December 2022. I have a due submission for Data Science Sp. I  need to access the IBM course.", "Specialisation change in 4th semester from full stack to PDT", "I had dropped my minor in entrepreneurship last semester but collpoll did not allowed me to complete my regitstration without registering for the minor course. Please remove that course from my registration. Thank You. ", "I'm unable to register. I'm trying but it's giving an error \"Register for all regular core courses of specialisation first\", even when I have already added the course in the cart."], "Responses": ["Dear Student, you have not opted for any specialization at the time of choosing specialization on webapp, that's why you have come under non specialization", "Dear Student,Specialization change is not possible, still you can connect with Dr. Indrajeet Gupta so that he can help you with this", "if you have not opted for any specialization on the Webapp then kindly contact to Dr. Indrajeet Gupta to get it done", "Dear Student, Please specify which specialization are you in", "Dear Student, Specialization change is not possible now, you can still connect with Dr. Indrajeet Gupta if he can allow you", "Dear Student, Specialization change is not allowed now, you can still connect with Dr. Indrajeet Gupta if he can allow", "Dear Student, Kindly contact to Dr. Indrajeet Gupta regarding query related to Coursera", "Dear Student, Kindly contact to Dr. Indrajeet Gupta regarding query related to Coursera", "Dear Student,\n\nyou can contact Dr. Indrajeet Gupta for any query related to Coursera.\nKindly get back incase of any other query.\nThanks", "Dear Student,\n\nSpecialization Change is not possible after the Semester, you can still talk to Dr Indrajeet Gupta and understand better about the Specialization part.\nTalk to your mentor as well.", "Dear Student,\n\nyou have already opted the course, kindly share a drop request again after 21 as it needed to be removed from your specialization.\nThanks.", "Dear Student,\n\nKindly confirm if you have minor course in your specialization list?"]}, "25": {"Patterns": ["Thank a lot", "Okk Thank You", "Understood.\nThank you", "Ok thank you.I'll do it", "Thank You", "Thank you"], "Responses": ["welcome dear", "Ur Welcome, I will close the ticket, if its resolved.", "welcome", "welcome", "Welcome", "welcome"]}, "26": {"Patterns": ["I have done late registration as i had financial issues due to which i was unable to choose any specialization.But now ny registration is done so i want to choose data science as Specialisation.Please enroll me in data science specialisation.", "i didn't got the scholarship regarding being the ward of personal defense staff.", "Change of Parent name and number from father name to mother name(which I already provided in the Student personal information updation form) and phone no in my ID Card.", "Transcript of 6th semester required for foreign university admissions", "Semester wise Marksheet and conversion of Grades/SGPA into marks obtained (Semester wise) ", "How to apply for withdrawal of admission ", "How to apply for withdrawal of admission \n", "Need results for all semesters", "I am writing to request your assistance with an issue I have been experiencing. I have not been receiving emails regarding campus placements, and I am worried that I may be missing important information and opportunities.", "I require transcripts of my first four semesters for submission for summer training. Kindly provide the same.", "Transcript", "High Priority Request -> Please provide with the 7th semester Gradesheet/Transcript as I need it for applying to Masters in Foreign Universities. Name -: Shubham Gautam , Enrollment Number -: E19CSE086", "Hello Sir, I have requested COE for the Grade Sheet of 7th Semester and even after reminding with 2 mails, i haven't received a response. Is this the platform to request for a gradesheet? \n\nI am requesting for the GradeSheet of 7th Sem for masters ad", "wifi not working", "Can i recieve my Interim Transcripts sem-wise because the one i have recieved consist all semesters result at one place", "What is the procedure to change parents name in bennett records", "Would appreciate if I can have my consolidated result transcript. "], "Responses": ["Dear Student, you are added in the specialization but for course registration you need toc contact registration Department", "Dear Adarsh, Kindly contact registration department or mail at registrar@bennett.edu.in", "Dear Sirshak, Kindly contact Registration department for the change", "Dear Student,  contact to COE Department.", "Contact to COE Department. ", "Dear Sumit , Kindly contact Registration department.", "Dear Sumit, Kindly Contact Registration department for the same.", "Kindly contact to COE Department", "As per discussed kindly contact to Placement Department.", "Dear Student, Transcripts you need to collect from COE Department, Thanks.", "Kindly contact to COE department for transcript.", "Kindly contact to COE department for Gradesheet/Transcript.", "Dear Student,  For Gradesheet kindly contact to COE department & also cc to me.", "Dear Manan, Kindly contact IT department for wifi", "As discussed kindly contact to COE team for transcripts.", "As discussed kindly contact to Registry Department for transcripts.", "Dear Student,\nPlease contact to COE department in this regard. You can mail and copy to me."]}}