{"0": {"Patterns": ["I am a CSE 2nd year student and I wanted to drop my ICIE281M Minor. Here is my drop form. \nRegards,\nSiddharth Suman Singh\nE21CSEU0617", "Greetings!\nI want to drop my minor course in entrepreneurship, I the form signed by our faculty. Kindly help me with the procedure. \nRegards\n", "i want to drop ICIE281M The world of startup ideas", "I want to drop the ICIE281M THE WORLD OF STARTUP IDEAS from academics.", "Is it ok sir", "Thank You Sir", "i wish to drop out of the CIE minor i have elected for", "thankyou sir", "Sir i am unable to upload the document", "I want to drop my course in CIE minor... course details are attached in the form", "Drop form", "Course Drop for Foundations of Entrepreneurship", "I have to drop cie minor course from my curriculum ", "this is the add/drop form", "Sir ,\nHow much time will it take ?", "Dropping CIE minor for 3rd sem", "I would like to change my batch from Eb09 to Eb05 .I have discussed this with Mr Deepak Garg and asked for his approval.", "change of elective course", "I want to change my open elective from Digital Marketing to Web Technologies. [B. Tech CSE 2nd Year]", "I want to change my open elective from CSET487 Digital Marketing to CSET382 Web Applications for my Btech 4th Semester. The add/drop form is attached with it.", "Here is the drop course performa", "Change my 3rd Semester Elective to CSET-382 WEB TECHNOLOGIES from CSET-492 Advance Skill enhancement", "Here is the Elective Add/Drop form. ", "i have uploaded the document and want to change open elective from digital marketing to web technology", "Hey! I'm willing to swap my Open Elective course with another.\n\n\nFrom: CSET 492 - Advanced Skill Enhancement\nTo: CSET 489 - Search Engine Optimization", "I raised a query before about my course registration as I had to register for my minor. I wanted to drop my minor. What do I do? I will attach my drop form from last semester.", "on it, thanks.", "I have uploaded the files", "Sir,\nI want to drop the course code ICIE282M.I am attaching the form.Kindly do the needful.", "Sir\nI would like to drop course code ICIE282M I am attaching the form kindly please do the needful", "drop CIE Minor", "form is filled"], "Responses": ["Dear Student,\n\nas per your request your course has been dropped", "Dear Student,\n\nas per your request your course has been dropped", "Dear Student,\n\nAs per your request your course has been dropped.\nThanks.", "Dear Student,\n\nAs per your request your course  has been dropped.", "Dear Student,\n\nAs per your request your course has been dropped", "Dear Student,\n\nAs per your request your course has been dropped", "Dear Student,\n\nAs per your request, your course has been  dropped.", "Dear Student,\nAs per your request your course has been dropped.", "Dear Student,\n\nAs per your request your course has been dropped.", "Dear Student,\n\nAs per your request your course has been dropped.", "Dear Student,\nAs per your request your course has been dropped.", "Dear Student,\n\nAs per your request your course has been dropped.", "Dear Student,\n\nAs per your request your course has been dropped.", "Dear Student,\n\nAs per your request your course has been dropped.", "Dear Student,\n\nAs per your request your course has been dropped.", "Dear Student,\n\nAs per your request your course has been dropped.", "Dear Student,\n\nAs per your request, your batch has been changed.\n\nThanks.", "Dear Student,\n\nAs per your request your course has been dropped, it will be updated on LMS Shortly.", "Dear Student,\n\nAs per your request your course has been dropped, it will be updated on LMS Shortly", "Dear Student,\n\nAs per your request your course has been dropped, it will be updated on LMS Shortly", "Dear Student,\n\nAs per your request your course has been dropped,", "Dear Student,\n\nAs per your request your course has been dropped, it will be updated on LMS Shortly.", "Dear Student,\n\nAs per your request your course has been dropped, it will be updated on LMS Shortly.", "Dear Student,\n\nAs per your request your course has been dropped, it will be updated on LMS Shortly", "Dear Student,\n\nAs per your request your course has been dropped, it will be updated on LMS Shortly", "Dear Student,\n\nAs per your request your course has been dropped", "Dear Student,\n\nAs per your request your course has been dropped, it will be updated on LMS Shortly.", "Dear Student,\n\nAs per your request your course has been dropped, it will be updated on LMS Shortly.", "Dear Student,\n\nAs per your request your course has been dropped", "Dear Student,\n\nAs per your request your course has been dropped", "Dear Student,\n\nAs per your request your course has been dropped.", "Dear Student,\n\nAs per your request your course has been dropped, it will be updated on LMS Shortly."]}, "1": {"Patterns": ["i have been facing issues which have been affecting my studies in this batch and would like to change batch so that i can perform better. ", "I would like to change batch from EB32 to EB11", "I want to change my batch from EB32 to EB05. I had bad experience the previous semester in the batch as most of my friends are from EB05", "I want to change my batch because i am not feeling comfortable in this batch and also i will become dayscholar from next or this mid semester and the friend whom with i will come to college is in EB30 so it will become easy for us to travel.", "Completely uncomfortable with the present batch.", "Not comfortable with my batchmates ", "I want to change my batch since I am not comfortable enough with my batchmates since our ideologies didn’t seem to match with each other. I would want to switch to EB19 since I am well known with the students there and can work easily with them.", "Sir, In batch change option I wanted to change my batch to EB-25 which was reflecting there but when I clicked on it. The page crashed and when I reload it, it was showing that my batch is changed to EB-21 but I wanted it to change to EB-25.", "This is what shown in app", "Sir, as you told us that batch change can only done once in entire degree program an I don't want to waste it due to some internet connection problem please sir do it to Eb-25 as I won't ask again to do so", "Please sir as I reported immediately to the concern officials please listen to my request", "I want to change my batch to EB 24 as I have selected data science as my specialization and most of the students in that batch have opted for same.", "Sir, I wanted to change my batch to\nEB-25 but due to some error it is changed\nto EB-21 sir please do change it to EB-25\ncoz I don't want to lose this opportunity.\ncoz this is the last time we can change\nbatch. please sir help me", "Please sir do it", "I want to change my specialisation from CSET211: Statistical Machine Learning to CSET214: Data Analysis using Python ", "want to change to eb22", "sir all my friends, my rommate and mostly all the people I am familiar with are in Batch 36... so it would be easy for me to study or work in projects with people I am familiar with so please change my batch from 42 to 36", "sir I want to change my batch 34 to 33 becoz my brother is in 33 we want to study together ", "My enrollment no.is E22CSEU0997", "Sir/Ma'am I request that my batch be changed from B23 to B33, because I find myself more compatible with my friends in B33 rather than B23. I think it will also have a positive effect on my academics and mental health.\n\nthank you,\nPratham tiwari.", "i want to switch to batch 4", "i want to change my batch from batch 10 to batch 11 as majority of the people there are on my floor and its very convenient to go home on weekends when we have same timetable kindly change my batch from batch 10 to only batch 11 ", "How do I get my batch changed going forward in the 2nd sem. A formal application? but to whom? ", "I would like to change my Batch", "Name - Tanya Khera\nEnrollment Number - E21CSEU0659\nCurrent Batch - EB24\nNew Batch - EB25\nI would like to change my batch from EB24 to EB25", "please change my batch from 14 to 15 if possible, thank you.", "application for batch change", "how do i change my batch", "I want to change my batch to eb19", "I request you to pls consider my batch change now since I was having a flight while the portal was open. it was a very short period bcz of which many did not enroll", "I request you to pls consider my batch change now since I was travelling while the portal was open. it was a very short period bcz of which many did not enroll.", "I request you to please consider my batch change now since I was travelling while the portal was open. it was a very short period, and the time given was to short because which many did not enroll.", "I request you to pls consider my batch change now since I was having a traveling while the portal was open. it was a very short period because of which many did not enroll..", "My current batch is EB06 and I would like to request to change it to EB24. I had a conversation with the class BR and Neeti Mam, I got to know few students left the batch and hence the vacancy in it. Environment in EB24 will definitely help me grow.", "The portal was open for a very limited time! It was not possible for many of us since people did not just travel bye train but flights as well. The timing must've been a bit more exceeded if it was open just for a day !", "I want to change my batch from eb07 to eb19 is it possible now? Can you please revert back if it is still possible.", "According to the mail and sent by Deepak sir 'Batch Change' was supposed to be in the tray, I tried to find it in the given time frame but couldn't. It was later when I opened the 'Acad queries' where I found it as an option. Kindly reconsider.", "Dear Sir,\nI want to change my batch from EB-25 to EB-28 but it was showing batch strength full at time I was trying to change. Now , I get to know from my friends that 2 student left batch and their strength remained 28 . so, please allow me.", "From eb27 to eb08", "I want to switch batches to EB09, since i have an internship and my timetable alignes better with EB09 i wish to change my batch", "Respected sir/mam,\n\nI have requested for batch change it showed approved in the app but not yet updated in collpoll and I haven't received approved mail to  my outlook please help me out\n\nThank you.", "I had kept a request in this app to change my batch on 16 jan2023.can you please say when will it reflect on collpoll or get a confirmation mail regarding that.", "In retrospect this elective isn't relative to my degree and future plans and would like to select a more befitting course that would increase the value of my CV", "Sir,\nAs per our conversation over the call yesterday, i would request you to change my elective from SEO to WebTechnologies. \nThanks.\n\nName: Abheek Tripathy\nEnroll: E21CSEU0123\nBatch: EB08 \nBtech 2nd year.\nPhone No: +91 8920237098"], "Responses": ["Dear Student,  Batch Change Requests will start from Tuesday (9th August) at 9AM to 9PM only. where you can select the available batches.", "Dear Student,  Batch Change Requests will start from Tuesday (9th August) at 9AM to 9PM only. where you can select the available batches.", "Dear Student,  Batch Change Requests will start from Tuesday (9th August) at 9AM to 9PM only. where you can select the available batches.", "Kindly raise your request through batch change option in your CSEBU webapp", "Dear Student,  Batch Change Requests has started today from 9AM to 9PM only. where you can select the available batches. Kindly select the required batch now.", "raise your request through batch change option on your app", "you need to request on batch change function only please check your app and opt for batch change option", "Dear Student, it is not possible now to change it further", "Dear Student, it is not possible now to change it further", "Dear Student, it is not possible now to change it further", "Dear Student, it is not possible now to change it further", "Dear Student, Batch change window has already been closed, it was only possible through the app in that window only", "Dear Student, there was no error in the system, now changing of batch is not possible", "Dear Student, there was no error in the system, now changing of batch is not possible", "Dear Student change of Specialization is not possible now", "Dear Student, Batch change is not allowed now in this semester you can change it in next Semester", "Batch  change is not possible, as there is no vacancies in any batch. If availability is there you will get an option in next semester, as well as you will be infromed in collpol.", "Dear Sahil, I am really sorry as batch change is not possible, still you can wait for the next semester, if any vacancies are generated  then you can see on collpol.", "Dear Sahil, I am really sorry as batch change is not possible, still you can wait for the next semester, if any vacancies are generated  then you can see on collpol.", "Dear Pratham,  I understand, but my dear there is no vacancy in any batches right now, in next semester that is in January, if there is any vacancy in that batch then definetly we will change. Till then stay positive.", "Dear Dhruv, Batch change is not possible. You will be intimated when options will be open.", "Dear Rudraksh, Batch change is not possible, we will let you know if there is any option.", "Dear Shobit, Batch change has not started yet, we will inform everyone once its open also the process to apply for change.", "dear kancharla, Batch change requests will be accepted from CSET Webapp on 16th January Time: 3 PM to 6 PM only if the target batch student count does not go beyond 30.", "Dear Student,\n\nBatch change application will open on CSET Webapp on 16th January from 3 PM to 6 PM", "Dear Pratibha, Batch change window will be open on CSET Webapp on 16th January from 3 PM to 6 PM.", "Dear Student,\nBatch change window will open on Monday from 3 to 6 PM on CSEBU Webapp.", "Dear Student,\n\nBatch change window has been closed as directed in the mail it was open from 3 to 6 PM today.\nThanks", "Dear Student,\n\nBatch change window has been closed as directed in the mail it was open from 3 to 6 PM today.\nThanks", "Dear Student,\n\nThe batch change window was open from 3 PM to 6 PM on 16/01/23\nNo request of batch change is possible now.\nyou can try in next semester.\nThanks.", "Dear Student,\n\nThe batch change window was open from 3 PM to 6 PM on 16/01/23\nNo request of batch change is possible now.\nyou can try in next semester.\nThanks.", "Dear Student,\n\nThe batch change window was open from 3 PM to 6 PM on 16/01/23\nNo request of batch change is possible now.\nyou can try in next semester.\nThanks.", "Dear Student,\n\nThe batch change window was open from 3 PM to 6 PM on 16/01/23\nNo request of batch change is possible now.\nyou can try in next semester.\nThanks.", "Dear Student,\n\nThe batch change window was open from 3 PM to 6 PM on 16/01/23\nNo request of batch change is possible now.\nyou can try in next semester.\nThanks.", "There is no scope now as the system was automated and it has been locked.\nyou can try batch change in next semester.\nThanks.", "Dear Student,\n\nThe batch change window was open from 3 PM to 6 PM on 16/01/23\nNo request of batch change is possible now.\nyou can try in next semester.\nThanks.", "There is no scope now as the system was automated and it has been locked.\nyou can try batch change in next semester.\nThanks.", "Dear Student,\n\nBatch change window was open from 3 PM to 6 PM on 16/01/2023.\nnow it has been closed and any change is not possible.\nThanks.", "Dear Student,\n\nBatch change window was open from 3 PM to 6 PM on 16/01/2023.\nnow it has been closed and any change is not possible.\nThanks.", "Dear Student,\n\nThe batch change window was open from 3 PM to 6 PM on 16/01/23\nNo request of batch change is possible now.\nyou can try in next semester.\nThanks.", "Dear Student,\n\nThe batch change window was open from 3 PM to 6 PM on 16/01/23\nNo request of batch change is possible now.\nyou can try in next semester.\nThanks.", "Dear Student,\n\nThe batch change window was open from 3 PM to 6 PM on 16/01/23\nNo request of batch change is possible now.\nyou can try in next semester.\nThanks.", "Dear Student,\nThe deadline to change your course has already been passed, now there is no scope of elective change.\nThanks.", "Dear Student,\nThe deadline to change your course has already been passed, now there is no scope of elective change.\nThanks."]}, "2": {"Patterns": ["want to change batch from batch 51 to 52 ", "As I think group study is the better way to improve your acads and l and most of my wingmate are in same batch (B-33) and I'm the one who always feel leftout whenever they'd be having a GD and all study kind stuff. so please help me out to improve it", "change the batch from 13 to 12", "Change my batch from B37 to B 34", "Batch change to 52", "My friends are in batch 34 please change my batch to batch 34", "i want to change batch due to time table and lack of good study environment ", "Batch 14", "no communication ", "I want to change my batch to 24, currently I am in batch 22, and I don't have any communication and have a lot of trouble, please consider my request ", "I want to change my batch to 24 or batch 17, currently I am in batch 22. And I am having a lot of troubles in my current batch.", "Please change my batch to 24 or 17, I am having a lot of trouble with my current batch 22", "I have to change my from 28 to 46 as because I am unable to study in my own batch . I am uncomformtable in my batch that's why I have to change.", "i want to change batch", "I am not comfortable with some of the members and teachers in my batch(41) and want to be in my roommate's batch(42) so that we both can coordinate easily. ", "Please change my batch to batch 24 or batch 9, I am having a lot of troubles with my current batch 22", "Would like to be in batch 14", "Change to batch 21", "my friends are in batch 34 please change my batch to batch 34", "I really want to change my batch due to some really reasons . please help me with it", "Please help me with it. I'll be grateful.", "I would like to change my Batch to 28", "regarding batch change ", "Need to change my batch from 49 to 35", "i want to change my batch from 17 to batch 15 ", "nnnn", "When will batch change option come", "Batch change", "My batch mates are not supportive and they don't have helping nature so I want to change my batch to batch 45. Kindly help me out it will definitely help me in my studies... ", "i want to change my batch in b31 ", "I want to change batch ", " i'm failing to changing my batch because in new batch section nill batch's showing", "sorry for the late submission,  But i would like to change my batch from Batch-4 to Batch-3.Please", "Sir i wanted to change my batch 14 to batch23"], "Responses": ["Window is already closed, you can again try your luck in the next semester.", "Window is already closed, you can again try your luck in the next semester.", "Window is already closed, you can again try your luck in the next semester.", "Window is already closed, you can again try your luck in the next semester.", "Window is already closed, you can again try your luck in the next semester.", "Window is already closed, you can again try your luck in the next semester.", "Window is already closed, you can again try your luck in the next semester.", "Window is already closed, you can again try your luck in the next semester.", "Window is already closed, you can again try your luck in the next semester.", "Window is already closed, you can again try your luck in the next semester.", "Window is already closed, you can again try your luck in the next semester.", "Window is already closed, you can again try your luck in the next semester.", "Window is already closed, you can again try your luck in the next semester.", "Window is already closed, you can again try your luck in the next semester.", "Window is already closed, you can again try your luck in the next semester.", "Window is already closed, you can again try your luck in the next semester.", "Window is already closed, you can again try your luck in the next semester.", "Window is already closed, you can again try your luck in the next semester.", "Window is already closed, you can again try your luck in the next semester.", "Window is already closed, you can again try your luck in the next semester.", "Window is already closed, you can again try your luck in the next semester.", "Window is already closed, you can again try your luck in the next semester.", "Window is already closed, you can again try your luck in the next semester.", "Window is already closed, you can again try your luck in the next semester.", "Window is already closed, you can again try your luck in the next semester.", "Window is already closed, you can again try your luck in the next semester.", "Window is already closed, you can again try your luck in the next semester.", "Window is already closed, you can again try your luck in the next semester.", "Window is already closed, you can again try your luck in the next semester.", "Window is already closed, you can again try your luck in the next semester.", "Window is already closed, you can again try your luck in the next semester.", "It was a Dynamic window. Window is already closed, you can again try your luck in the next semester.", "Window is already closed, you can again try your luck in the next semester.", "Window is already closed, you can again try your luck in the next semester."]}, "3": {"Patterns": ["where can i get the add drop form?", "where can i get that form", "where can i get that form?", "open elective change from Nonlinear Dynamics and Machine Learning in Complex Systems to Digital Marketing ", "open elective change from Nonlinear Dynamics\nand Machine Learning\nin Complex Systems to digital marketing ", " I want to change my open elective subject\n I have selected digital marketing by mistake just now\n Can you help me change it to Web technologie", "change open elective ", "I completed my course registration on 10th January. Till then only four courses were being displayed including SEO which I chose. It was later that more subjects were added to choose from. I would like to drop SEO and take Web Technology CSET382.", "Would like to change my Elective from Advanced Skill Enhancement to Sociology ", "what is the procedure to drop minor?", "I want to change my open elective from \"Advanced skill enhancement\" to \"Web technology\". Batch-EB05 (2021 BATCH) Enrollement no.-E21CSEU0004", "Change of open elective from Non linear dynamics and machine learning in complex system to Digital Marketing", "i want to change my elective, as i selected android app development first but i am learning it side by side and i want to re-opt for another elective, please help", "open elective change from search engine optimization to digital marketing\n", "I want to change my open elective from CSET-489(Search Engine Optimisation) to CSET-487(Digital Marketing).", "I would like to change my open elective from “Non-linear dynamics and ML in complex systems” to “Digital Marketing”.  I have completed the necessary registration process as well.", "Sir I have selected Advanced skill enhancement as my elective in the 4th semester but I want to change my elective as digital marketing for the 4th semester.", "I'd like to change my open elective from Advanced Skill Enhancement to Digital Marketing.", "I want to drop my specialisation from gaming and add to full stack  as I am not able to understand the course ,more interested in web development please accept my request for changing my specialisation course", "I want to change my open elective from digital marketing to web technology", "I want to change my open elective from Digital Marketing to Android Development with Kotlin.", "I want to change my open elective from Digital Marketing with Android Development with Kotlin for 4th semester.", "I am currently enrolled in Regular Open elective called \" Nonlinear Dynamics and Machine Learning in Complex Systems\". However I want to change it to \"Search Engine Optimization\". I tried doing so through CollPoll itself, but couldn't do so.", "Changing elective course", " I would like to change my open elective from digital marketing CSET487 to web technologies CSET382.The options displayed for open electives at the time of registration i.e. 17th January 2023 didn't show web technologies.", "I would like to change my open elective from Digital Marketing CSET487 to Search Engine Optimization CSET489.", "I have taken Digital Marketing as Open Elective, Iwould like to change to Web Technologies.", "I want to change my open elective from Advance skills to biological machines. I have a strong interest in biology, and I know it's too late, but I was wondering if you could help me.", "ICIE282M: Understanding Markets and Customers,\n I would like to drop this course."], "Responses": ["Dear Student,\nyou can get the form in the mail sent by Registrar before the registration in Early August.\nthere will be a dccument consisting of multiple things and the form is in Annexure 2.", "Dear Student,\nyou can get the form in the mail sent by Registrar before the registration in Early August.\nthere will be a dccument consisting of multiple things and the form is in Annexure 2.", "Dear Student,\nyou can get the form in the mail sent by Registrar before the registration in Early August.\nthere will be a dccument consisting of multiple things and the form is in Annexure 2.", "Dear Student,\n\nyou can drop your course by filling out the add/drop form sent in the mail by Registrar in guidelines for registration.\nPlease fill the form and share it on this platform only.\nThanks.", "Dear Student,\n\nyou can drop your course by filling out the add/drop form sent in the mail by Registrar in guidelines for registration.\nPlease fill the form and share it on this platform only.\nThanks.", "Dear Student,\n\nyou need to fill the add/drop form.\nit is shared in the mail by registrar, it is there in the registration guidelines in annexure 3\nThanks", "Dear Student,\n\nyou need to fill the add/drop form.\nit is shared in the mail by registrar, it is there in the registration guidelines in annexure 3\nThanks", "Dear Student,\n\nkindly fill the Add/drop form, you can find the form in guidelines shared by Registrar before commencement of this semester.\nit is in Annexure 3\nThanks.", "Dear Student,\n\nyou can drop your course by filling out the add/drop form sent in the mail by Registrar in guidelines for registration.\nPlease fill the form and share it on this platform only.\nThanks", "Dear Student,\n\nyou need to fill the add/drop form. and send it on this portal only.\nyou can find the add/drop form in the mail shared by registrar before commencement of this semester.\nit is named as student registration guidelines.\nThanks.", "Dear Student,\n\nyou need to fill the add/drop form. and send it on this portal only.\nyou can find the add/drop form in the mail shared by registrar before commencement of this semester.\nit is named as student registration guidelines.\nThanks.", "Dear Student,\n\nyou can drop your course by filling out the add/drop form sent in the mail by Registrar in guidelines for registration.\nPlease fill the form and share it on this platform only.\nThanks", "Dear Student,\n\nyou can drop your course by filling out the add/drop form sent in the mail by Registrar in guidelines for registration.\nPlease fill the form and share it on this platform only.\nThanks", "Dear Student,\n\nyou can drop your course by filling out the add/drop form sent in the mail by Registrar in guidelines for registration.\nPlease fill the form and share it on this platform only.\nThanks", "Dear Student,\n\nyou can drop your course by filling out the add/drop form sent in the mail by Registrar in guidelines for registration.\nPlease fill the form and share it on this platform only.\nThanks", "Dear Student,\n\nyou can drop your course by filling out the add/drop form sent in the mail by Registrar in guidelines for registration.\nPlease fill the form and share it on this platform only.\nThanks", "Dear Student,\n\nyou can drop your course by filling out the add/drop form sent in the mail by Registrar in guidelines for registration.\nPlease fill the form and share it on this platform only.\nThanks", "Dear Student,\n\nyou need to fill the add/drop form. and send it on this portal only.\nyou can find the add/drop form in the mail shared by registrar before commencement of this semester.\nit is named as student registration guidelines.\nThanks.", "Dear Student,\n\nyou need to fill the add/drop form. and send it on this portal only.\nyou can find the add/drop form in the mail shared by registrar before commencement of this semester.\nit is named as student registration guidelines.\nThanks.", "Dear Student,\n\nyou can drop your course by filling out the add/drop form sent in the mail by Registrar in guidelines for registration.\nPlease fill the form and share it on this platform only.\nThanks", "Dear Student,\n\nyou can drop your course by filling out the add/drop form sent in the mail by Registrar in guidelines for registration.\nPlease fill the form and share it on this platform only.\nThanks", "Dear Student,\n\nyou can drop your course by filling out the add/drop form sent in the mail by Registrar in guidelines for registration.\nPlease fill the form and share it on this platform only.\nThanks", "Dear Student,\n\nyou can drop your course by filling out the add/drop form sent in the mail by Registrar in guidelines for registration.\nPlease fill the form and share it on this platform only.\nThanks", "Dear Student,\n\nyou can drop your course by filling out the add/drop form sent in the mail by Registrar in guidelines for registration.\nPlease fill the form and share it on this platform only.\nThanks", "Dear Student,\n\nyou can drop your course by filling out the add/drop form sent in the mail by Registrar in guidelines for registration.\nPlease fill the form and share it on this platform only.\nThanks", "Dear Student,\n\nyou can drop your course by filling out the add/drop form sent in the mail by Registrar in guidelines for registration.\nPlease fill the form and share it on this platform only.\nThanks", "Dear Student,\n\nyou can drop your course by filling out the add/drop form sent in the mail by Registrar in guidelines for registration.\nPlease fill the form and share it on this platform only.\nThanks", "Dear Student,\n\nyou can drop your course by filling out the add/drop form sent in the mail by Registrar in guidelines for registration.\nPlease fill the form and share it on this platform only.\nThanks", "Dear Student,\n\nyou can drop your course by filling out the add/drop form sent in the mail by Registrar in guidelines for registration.\nPlease fill the form and share it on this platform only.\nThanks"]}, "4": {"Patterns": ["Respected Sir,\n\nGood Afternoon, I would like to request you that I want to change my respected batch from EB08 To EB05.\nThe following are the reasons mentioned in the image attached.\n", "batch change ", "I want to change my batch", "batch Change", "No options of batches available", "Want to change my batch from EB-28 to EB-23", "I have been dealing with some issues with the current batch affecting my academics as well hereby I want to change my batch ", "Batch change from EB18 to EB06", "I am batch EB-17 student and want to go to batch EB - 14"], "Responses": ["Dear Student, you are requested to kindly refer the mail shared by dean Sir today and apply at that time only.", "Dear Student kimdly refer to the mail shared by Dean Sir today and raise your request at that time only through batch change functionality on CSEBU webapp", "Dear Student, kindly refer to the mail shared by dean Sir today and raise your request accordingly", "Dear Student kindly refer to the mail shared by dean Sir today regarding Batch change", "Dear Student kindly refer to the mail shared by dean Sir today regarding Batch change", "kindly refer to the mail shared by dean Sir today regarding batch change", "Dear Student, regarding batch change kindly refer to the mail shared by dean sir today", "Dear Student, Kindly refer to the mail shared by Dean Si regarding Batch change", "Dear Student, Kindly refer to the mail shared by dean Sir regarding batch change"]}, "5": {"Patterns": ["2nd batch", "Where it is?", "need batch changed from b1 to b2. conflict of interest with certain individuals, best way to avoid more drama is to seperate us.", "I would like to change my batch from batch 03 to 01 since 03 is going to get dissolved.", "Batch change from BCA Batch-3 to BCA Batch-1 due to dissolution of Batch-3", "Sir i  my course registration  it showing gaming specialization but i have done registration  of only cybersecurity so pleasehelo", "Course to be dropped - Big Data Analytics and Business Intelligence | CSET371 | 3credits , Course to be added - Data Visualization and Dashboards | CSET370 | 3 credits", "i attended the first class of agile but it seems i will be able to do much better in C++ class. Also i will be able to brush up my programing skills.", "I am a third year student and i want to change my elective from Agile Software Development to C++. My enrollment number is E20CSE167", "Yes sir i was able to add c++ now", "Thankyou", "Chnage course from CSET344-Image and Video Processing to CSET-Natural Language Processing", "sir/mam \nMy self Chandresh 2nd year student .Sir when I add all course it became total 25 credit and it is mention that it should be min 26 and when I click on complete registration ,it wont be .\nWhat to do ?\nI have mailed on outlook before17 aug 5pm", "I have recently changed my specialization elective from Big Data Analytics to Data visualization and Dashboards but the change is not reflected on my LMS.", "I have recently changed my specialization programme elective from Big Data Analytics and Business Intelligence to Data visualization and Dashboards but the change is not reflected on my LMS.", "Please change my specialisation elective to Data Visualisation and Dashboards.", "PS : It was previously Big Data Analytics.", "I have not done the course registration so i am unable to see the specialization course in the lms,kindly look into it.", "I can't see my full stack specialisation course CSET218", "attendance is not correct", "At which option in collpoll app we can see our attendance?", "i can't available to access my assignment and can't available to upload because it's not showing any assignment can you fix it fast i have to submit my assignment or otherwise i will lose my marks "], "Responses": ["Dear student your batch changing request has been updated on collpoll, kindly check", "Dear Student, due to some technical error it was not visible, CollPoll team has worked on this", "Dear student, your request has been updated on collpoll, kindly check", "Dear student, your request has been updated on collpoll, kindly check", "Dear student, your request has been updated on collpoll, kindly check", "Dear Student, you need to raise your request through Add/drop feature on CollPoll for dropping the course", "Dear Student,  kindly send request for Add/Drop courses on CollPoll.", "Dear Student, it has been updaed on CollPoll. but next time you are requested to send the add/drop request on CollPoll.", "Dear Student, it has been updaed on CollPoll. but next time you are requested to send the add/drop request on CollPoll.", "Dear Student, As I have checked your registered courses. it has been updated on CollPoll.", "Dear Student, As I have checked your registered courses. it has been updated on CollPoll.", "Dear Student,  add/drop request you need to send on CollPoll.", "Dear Student, this is due to technical glithch and it has raised to collpoll. if it is not adressed yet then kindly put a reminder to it so that it can be escalated", "Dear Student, It will be visible on LMS this week.", "Dear Student, It will be updated on LMS this week.", "Dear Student, I have checked your registered courses on CollPoll in which you have taken Data Visualization as elective and it will be updated on LMS this week.", "Dear Student, I have checked your registered courses on CollPoll in which you have taken Data Visualization as elective and it will be updated on LMS this week.", "Course Registration on CollPoll or LMS? Please specify", "Dear Student it is not visible on CollPoll or LMS?", "Yes, due to some technical glitch it is not reflecting on your collpoll, we are working on it and it will be updated soon", "kindly dont follow attendance in collpoll for the time being.", "Updated"]}, "6": {"Patterns": ["I had to do my registration but when I select the courses which I have to do with all requirements, It shows that please select the regular courses of the specialization i.e. Artificial intelligence.Please fix this issue \nRegards,\nTanishq Agarwal", "requesting for the marksheet of sem 1 and sem 2 for BTech CSE 2021-25 batch", "I have done late registration as i had financial issues due to which i was unable to choose any specialization.But now ny registration is done so i want to choose data science as Specialisation.Please enroll me in data science specialisation.", "I uploaded my initial goal report of 7th semester internship on the portal and it was visible on the portal. Today, when I opened the portal for uploading my mid-way internship report my initial goal report was not there. Please kindly check.", "i didn't got the scholarship regarding being the ward of personal defense staff.", "Change of Parent name and number from father name to mother name(which I already provided in the Student personal information updation form) and phone no in my ID Card.", "Requesting to get my marksheet as my parents are asking for it Thank You", "My mentor is unable to give evaluation marks, it's producing an error saying, Company Mentor not found, kindly check asap.", "Transcript of 6th semester required for foreign university admissions", "Semester wise Marksheet and conversion of Grades/SGPA into marks obtained (Semester wise) ", "How to apply for withdrawal of admission ", "How to apply for withdrawal of admission \n", "Need results for all semesters", "I am writing to request your assistance with an issue I have been experiencing. I have not been receiving emails regarding campus placements, and I am worried that I may be missing important information and opportunities.", "I require transcripts of my first four semesters for submission for summer training. Kindly provide the same.", "some of my courses are not available and in cse course the content in it is Missing ", "In LMS.", "Transcript", "High Priority Request -> Please provide with the 7th semester Gradesheet/Transcript as I need it for applying to Masters in Foreign Universities. Name -: Shubham Gautam , Enrollment Number -: E19CSE086", "Hello Sir, I have requested COE for the Grade Sheet of 7th Semester and even after reminding with 2 mails, i haven't received a response. Is this the platform to request for a gradesheet? \n\nI am requesting for the GradeSheet of 7th Sem for masters ad", "I do not see the option for course registration on collpoll", "wifi not working", "I did my clearance yesterday, so today I want to change my I'd card to day schoalr", "I did my clearance yesterday, so today I want to change my I'd card to day scholar", "i want to change my elective from ANDROID APPLICATIONS USING KOTLIN to DIGITAL MARKETING", "Can i recieve my Interim Transcripts sem-wise because the one i have recieved consist all semesters result at one place", "What is the procedure to change parents name in bennett records", "Changing open elective from ANDROID APPLICATIONS USING KOTLIN ", "Would appreciate if I can have my consolidated result transcript. "], "Responses": ["Dear Student you are requested to contact Collpoll , CoE Department. Mail them on support@collpoll.com , coeoffice@bennett.edu.in and put me in cc ( kamal.singh@bennett.edu.in).", "Kindly contact Examination Department and your respective Mentor", "Dear Student, you are added in the specialization but for course registration you need toc contact registration Department", "Today i have tried contact with you but your mobile no was switch off so kindly contact to me ASAP.", "Dear Adarsh, Kindly contact registration department or mail at registrar@bennett.edu.in", "Dear Sirshak, Kindly contact Registration department for the change", "Dear Student, for marksheets you can contact to Examination Department.", "Dear Student, kindly contact to Mr. Tarun (Contact number - 7827129373)", "Dear Student,  contact to COE Department.", "Contact to COE Department. ", "Dear Sumit , Kindly contact Registration department.", "Dear Sumit, Kindly Contact Registration department for the same.", "Kindly contact to COE Department", "As per discussed kindly contact to Placement Department.", "Dear Student, Transcripts you need to collect from COE Department, Thanks.", "Dear Prabhav, Kindly contact Mr. Shakti Singh <shakti.singh@bennett.edu.in> he is available at lab B LA 108", "Dear Prabhav, Kindly contact Mr. Shakti Singh <shakti.singh@bennett.edu.in> he is available at lab B LA 108", "Kindly contact to COE department for transcript.", "Kindly contact to COE department for Gradesheet/Transcript.", "Dear Student,  For Gradesheet kindly contact to COE department & also cc to me.", "Dear Student,\n\nKindly contact to regitry department,\nyou can write to registrar@bennett.edu.in\n and support@collpoll.com", "Dear Manan, Kindly contact IT department for wifi", "Dear Student,\n\nKindly contact at Finance@bennett.edu.in\nDivya.agrawal@bennett.edu.in", "Dear Student,\n\nKindly contact at Finance@bennett.edu.in\nDivya.agrawal@bennett.edu.in", "Dear Karan, Kindly contact your Program Coordinator", "As discussed kindly contact to COE team for transcripts.", "As discussed kindly contact to Registry Department for transcripts.", "Kindly contact your program Cordinator, Mr. Nikhil Mishra", "Dear Student,\nPlease contact to COE department in this regard. You can mail and copy to me."]}, "7": {"Patterns": ["I want to drop minor course of entrepreneurship.", "I want to drop minor course for entrepreneurship and change my open elective", "I want to change my open elective from Search engine optimization to advanced skill enhancement ", "This is regarding the course that is CSET-231(Programming Methodologies for Backend) is not visible on my LMS. That particular course is not visible so that's why I am not able to submit my any assignments. So kindly look into this matter.", "Academic Fee is paid and Courses are Registered but CSET301: Artificial Intelligence and Machine Learning is not visible on LMS.", "2 courses - CSET301 and CSET487 are not visible on my LMS. Instead, CSET208 is visible, which the AI specialisation students are not supposed to take in this semester.", "\nadd EPHY384L & drop CSET208 ethics", "Add digital marketing and drop ethics", "Please change my open elective from digital marketing to sociology of gender", "I would want to change my open elective from CSET489 SEO to CSET382 Web Technologies. I completed my registration on 10th and other course options were added later. I am attaching the proforma, kindly change my open elective.", "Open elective course to be DROPPED: CSET492 (Advanced Skill Development)\n\nReason: Already mapped\n\nName: Soham Datta\nBatch-EB07\nE21CSEU0980", "Sir is it done?", "Changing the course", "Changing elective ", "Enrollment number = E21CSEU0895\nCourse code= CSET231\nCourse Name = Programming Methodologies for Backend Development\t\nThis course is not visible on my lms. Please help me", "unavailability of the time table of DR.Aditya Bharadwaj on scset webApp.", "Name: Manu Chaitanya\nCourse CODE: cset231\nCourse Name: Programming Methodologies for Backend Development\nThis course is not visible on LMS .Please Help me", "I switched from the EB09 batch to the EB05 batch, but when I go to submit my assignments, it still shows EB09 submission."], "Responses": ["Dear Student,\n\nYour request has been received and your course will be updated shortly.\nThanks.", "Dear Student,\n\nYour request has been received and your course will be updated shortly.\nThanks.", "Dear Student,\n\nYour request has been received and your course will be updated shortly.\nThanks.", "Dear Student,\n\nYour request has been received and your course will be updated shortly.\nThanks.", "Dear Student,\n\nYour request has been received and your course will be updated shortly.\nThanks.", "Dear Student,\n\nYour request has been received and your course will be updated shortly.\nThanks.", "Dear Student,\n\nYour request has been received and your course will be updated shortly.\nThanks.", "Dear Student,\n\nYour request has been received and your course will be updated shortly.\nThanks.", "Dear Student,\n\nYour request has been received and your course will be updated shortly.\nThanks.", "Dear Student,\n\nYour request has been received and your course will be updated shortly.\nThanks.", "Dear Student,\n\nYour request has been received and your course will be updated shortly.\nThanks.", "Dear Student,\n\nYour request has been received and your course will be updated shortly.\nThanks.", "Dear Student,\n\nYour request has been received and your course will be updated shortly.\nThanks.", "Dear Student,\n\nYour request has been received and your course will be updated shortly.\nThanks.", "Dear Student,\n\nYour request has been received and your course will be updated shortly.\nThanks.", "Dear Student,\n\nYour request has been received and your Query will be resolved shortly.\nThanks", "Dear Student,\n\nYour request has been received and your course will be updated shortly.\nThanks.", "Dear Student,\n\nYour request has been received and your course will be updated shortly.\nThanks."]}, "8": {"Patterns": ["minimum should be 26credits\nbut after choosing all mine was still 25 that's y i couldn't register ", "campus help center or outpass not working in collpoll", "Sir/mam, i have had my biometrics attendance done in classes but on Collpoll its not showing the correct attendance. Please consider my application. I have also attached the screenshot so do also check it out. So that you better understand situation.", "I am regularly attending the classes and doing the biometric attendance. But In collpoll my attendance is not updated. There I Am Marked as Absent", "Ma'am, I'm attending all the classes but my attendance is still 1/7 and my parents are asking me why is it like that. Please guide me,what should i do", "attendance not counting", "attendance not showing on collpoll app", "I have been attending my lecture daily and punching my addandance on machine but on coll poll it is showing unnecessly absent and not showing any present ", "I have my friends as witness that I'm attending lectures and puchi g my fingerprint", "Please update my coll poll properly it is not syncing", "When we could see our attendance on collpoll because till now it is showing 0% attendance for all subjects despite of attending classes.\n", "My Attendance doesn't get updated on collpoll ", "*Attendance*\nGood morning Sir/Mam,\nEven after attending, and putting my biometrics my attendance is not updated for the following classes:\nElectromagnetics Lecture: 24,25,30 Nov.\nComputation Thinking Lecture: 24,25Nov., Engineering calculus: 25nov.", "Good morning Sir/Mam, Even after attending, and putting my biometrics my attendance is not getting updated in my collpoll.\nEnrollment number:E22CSEU1750\nName: Sanya Gupta\nBatch:42", "ATTENDENCE ISSUE\nI've been attending all my classes and marking my biometrics in the respective device but still it is not reflecting in my coll poll. Kindly look into this issue. E22CSEU1239\n Thankyou ", "I am facing a attendance issue in Collpoll, \nI have attended all the classes of 'Engineering Calculus' and 'Computational Thinking and Programming', even the fingerprint scanner is accepting fingerprint but it is showing absent in this subject. ", "I can see issues in my attendance record..I've even sent multiple requests to collpoll application..but i see no update. please check (Kshitiz Saxena E22CSEU0232)", "I'm unable to register as registration option is not visible in my collpoll.", "I am unable to register courses on CollPoll. Unable to do Course Registration."], "Responses": ["Dear Studdent, if you have the screenshot of the same kindly write  at support@collpoll.com and saphal.a@collpoll.com cc to nikhil.mishra@bennett.edu.in", "Kindly write to support@collpoll.com", "Dear Diven, Kindly mail to c-saphal.anand@bennett.edu.in  or  Saphal Anand <saphal.a@collpoll.com> for all your queries regarding collpoll to get resolved", "Dear Tanish, kindly mail to c-saphal.anand@bennett.edu.in  or  Saphal Anand <saphal.a@collpoll.com> , for your collpoll queries to resolve", "Dear Mrituanjay, whenever you are using biomatrix make sure you punching after your concern Faculty. Aswell as see that your name is being displayed with green tick. Also you can mail to Saphal Anand at c-saphal.anand@bennett.edu.in  or saphal.a@collpoll.", "Dear Aman, Kindly mail to c-saphal.anand@bennett.edu.in or Saphal Anand <saphal.a@collpoll.com>  for collpoll related issues", "Dear Ansh, Kindly mail to Saphal Anand <saphal.a@collpoll.com>    or    c-saphal.anand@bennett.edu.in for collpoll related issues", "Dear Kunal, Kindly contact Collpoll, Mr. Saphal Anand for attendance. But to assure  if you are punching it properly and see your name displayed then your attendance is been recorded.", "Dear Kunal, Kindly contact Collpoll, Mr. Saphal Anand for attendance. But to assure  if you are punching it properly and see your name displayed then your attendance is been recorded.", "Dear Kunal, Kindly contact Collpoll, Mr. Saphal Anand for attendance. But to assure  if you are punching it properly and see your name displayed then your attendance is been recorded.", "Dear Kartike, its something which can be resolved by Collpoll, Kindly mail to Saphal Anand <saphal.a@collpoll.com> and cc to support@collpoll.com", "Dear Rajat, Kindly mail to support@collpoll.com and Saphal Anand <saphal.a@collpoll.com>  regarding your attendance.", "As i have already replied to your same query before therefore i am closing this query. kindly contact Saphal Anand <saphal.a@collpoll.com>\n\nsupport@collpoll.com     08045688015", "Dear Sanya, Kindly contact Saphal Anand <saphal.a@collpoll.com>\n\nsupport@collpoll.com", "Dear Aastha, I have acknowledged your query, also you drop a mail to Saphal Anand <saphal.a@collpoll.com> &\n\nsupport@collpoll.com", "Dear Shuaib, I have acknowledged your query, also you drop a mail to Saphal Anand <saphal.a@collpoll.com> & support@collpoll.com", "Dear Kshitiz,  I have acknowledged your query, collpoll will definetly response once the problem is resolved, still regarding your attendance mail to Saphal Anand <saphal.a@collpoll.com>\n\nsupport@collpoll.com", "Dear Student,\nKindly write at-\nRegistry@bennett.edu.in\nChetna.Pargai@bennett.edu.in\nSupport@collpoll.com\nsaphal.a@collpoll.com\n\nThanks.", "Dear Student,\n\nKindly write to support@collpoll.com\nsaphal.a@collpoll.com"]}}